skooch/espressif-qemu/tests/qtest/esp32s3-test.c
/*
 * QTest coverage for the ESP32-S3 machine.
 *
 * This initial suite focuses on the immediate fidelity program:
 * SPI1 transfer bounds, GP-SPI completion semantics, GPIO/IO_MUX state,
 * USB Serial/JTAG RX/TX behavior, I2C completion semantics, UART clock
 * dependence, SHA IRQ behavior, and the boot-critical ANA register path.
 */

#include "qemu/osdep.h"

#ifndef _WIN32
#include <sys/socket.h>
#include <sys/un.h>
#include <unistd.h>
#endif

#include "libqtest.h"
#include "qemu/bitops.h"
#include "glib/gstdio.h"

#include "hw/char/esp32_uart.h"
#include "hw/char/esp32s3_uart.h"
#include "hw/gpio/esp32s3_gpio.h"
#include "hw/gpio/esp32s3_iomux.h"
#include "hw/i2c/esp32_i2c.h"
#include "hw/misc/esp32c3_jtag.h"
#include "hw/misc/esp32s3_cache.h"
#include "hw/misc/esp32s3_rtc_cntl.h"
#include "hw/dma/esp32s3_gdma.h"
#include "hw/net/mii.h"
#include "hw/misc/esp32s3_rng.h"
#include "hw/misc/esp32s3_reg.h"
#include "hw/misc/esp_sha.h"
#include "hw/nvram/esp32s3_efuse.h"
#include "hw/ssi/esp32s3_gpspi.h"
#include "hw/ssi/esp32s3_spi.h"
#include "hw/xtensa/esp32s3_clk.h"
#include "hw/xtensa/esp32s3_clk_defs.h"

#define ANA_BASE                0x6000e000
#define SPI2_BASE               DR_REG_SPI2_BASE
#define SPI0_BASE               DR_REG_SPI0_BASE
#define SPI1_BASE               DR_REG_SPI1_BASE
#define GDMA_BASE               DR_REG_GDMA_BASE
#define GPIO_BASE               DR_REG_GPIO_BASE
#define IOMUX_BASE              DR_REG_IO_MUX_BASE
#define JTAG_BASE               DR_REG_USB_SERIAL_JTAG_BASE
#define I2C0_BASE               DR_REG_I2C_EXT_BASE
#define EMAC_BASE               DR_REG_EMAC_BASE
#define UART0_BASE              DR_REG_UART_BASE
#define SHA_BASE                DR_REG_SHA_BASE
#define SYSTEM_BASE             DR_REG_SYSTEM_BASE
#define INTMATRIX_BASE          DR_REG_INTERRUPT_BASE
#define APB_CTRL_BASE           DR_REG_APB_CTRL_BASE
#define RTC_CNTL_BASE           DR_REG_RTCCNTL_BASE
#define EFUSE_BASE              DR_REG_EFUSE_BASE
#define PMS_BASE                DR_REG_SENSITIVE_BASE
#define ASSIST_DEBUG_BASE       DR_REG_ASSIST_DEBUG_BASE
#define GENERIC_MMIO_TEST_REG   (DR_REG_WCL_BASE + 0xf00)
#define GENERIC_MMIO_TEST_REG2  (GENERIC_MMIO_TEST_REG + 4)
#define RTC_EXT_WAKEUP_CONF_REG (RTC_CNTL_BASE + 0x64)
#define RTC_EXT_WAKEUP1_REG     (RTC_CNTL_BASE + 0xe0)
#define RTC_RETENTION_CTRL_REG  (RTC_CNTL_BASE + 0x140)
#define RTC_WAKEUP_ENA_EXT1_BIT BIT(16)
#define CACHE_OP_DELAY_NS              1000
#define ESP32S3_CACHE_IA_SOURCE        56
#define ESP32S3_CACHE_CORE0_ACS_SOURCE 94
#define ESP32S3_EMAC_SOURCE            0
#define ESP32S3_GPIO_SOURCE            16
#define APB_CTRL_LEGACY_ECO3_DATE_REG  (APB_CTRL_BASE + 0x07c)
#define APB_CTRL_QEMU_ORIGIN_REG       (APB_CTRL_BASE + 0x3f8)
#define APB_CTRL_DATE_REG              (APB_CTRL_BASE + 0x3fc)
#define APB_CTRL_UNSUPPORTED_REG       (APB_CTRL_BASE + 0x080)
#define APB_CTRL_DATE_VALUE            0x02101150
#define APB_CTRL_LEGACY_ECO3_DATE      0x96042000
#define APB_CTRL_QEMU_ORIGIN           0x51454d55
#define INTMATRIX_CPU_STRIDE           0x800
#define INTMATRIX_INTR_STATUS0         0x18c
#define INTMATRIX_MAP_REG(cpu, source) \
    (INTMATRIX_BASE + ((cpu) * INTMATRIX_CPU_STRIDE) + ((source) * 4))
#define INTMATRIX_STATUS_REG(cpu, word) \
    (INTMATRIX_BASE + ((cpu) * INTMATRIX_CPU_STRIDE) + \
     INTMATRIX_INTR_STATUS0 + ((word) * 4))
#define SYSTEM_CPU_PER_CONF_SUPPORTED_MASK \
    (R_SYSTEM_CPU_PER_CONF_CPU_WAITI_DELAY_NUM_MASK | \
     R_SYSTEM_CPU_PER_CONF_CPU_WAIT_MODE_FORCE_ON_MASK | \
     R_SYSTEM_CPU_PER_CONF_PLL_FREQ_SEL_MASK | \
     R_SYSTEM_CPU_PER_CONF_CPUPERIOD_SEL_MASK)
#define SYSTEM_SYSCLK_CONF_SUPPORTED_MASK \
    (R_SYSTEM_SYSCLK_CONF_CLK_DIV_EN_MASK | \
     R_SYSTEM_SYSCLK_CONF_CLK_XTAL_FREQ_MASK | \
     R_SYSTEM_SYSCLK_CONF_SOC_CLK_SEL_MASK | \
     R_SYSTEM_SYSCLK_CONF_PRE_DIV_CNT_MASK)
#define EFUSE_OP_DELAY_NS       100000
#define EFUSE_READ_DONE         BIT(0)
#define EFUSE_PGM_DONE          BIT(1)
#define EFUSE_WRITE_OPCODE      0x5a5a
#define EFUSE_READ_OPCODE       0x5aa5
#define PMS_DATE_VALUE          0x02101280

#define OPENETH_MODER_DEFAULT          0xa000
#define OPENETH_MODER_LOOPBCK          BIT(7)
#define OPENETH_MODER_PRO              BIT(5)
#define OPENETH_MODER_TXEN             BIT(1)
#define OPENETH_MODER_RXEN             BIT(0)
#define OPENETH_INT_SOURCE_RXB         BIT(2)
#define OPENETH_INT_SOURCE_TXB         BIT(0)
#define OPENETH_MIICOMMAND_RSTAT       BIT(1)
#define OPENETH_MIICOMMAND_SCANSTAT    BIT(0)
#define OPENETH_MIISTATUS_LINKFAIL     BIT(0)
#define OPENETH_DEFAULT_PHY            1
#define OPENETH_MIIADDRESS_RGAD_SHIFT  8
#define OPENETH_MIIADDRESS_FIAD_SHIFT  0
#define OPENETH_TXD_RD                 BIT(15)
#define OPENETH_TXD_IRQ                BIT(14)
#define OPENETH_RXD_E                  BIT(15)
#define OPENETH_RXD_IRQ                BIT(14)
#define OPENETH_RXD_M                  BIT(7)

#define OPENETH_INT_SOURCE_REG         (EMAC_BASE + 0x04)
#define OPENETH_INT_MASK_REG           (EMAC_BASE + 0x08)
#define OPENETH_TX_BD_NUM_REG          (EMAC_BASE + 0x20)
#define OPENETH_MIICOMMAND_REG         (EMAC_BASE + 0x2c)
#define OPENETH_MIIADDRESS_REG         (EMAC_BASE + 0x30)
#define OPENETH_MIIRX_DATA_REG         (EMAC_BASE + 0x38)
#define OPENETH_MIISTATUS_REG          (EMAC_BASE + 0x3c)
#define OPENETH_MAC_ADDR0_REG          (EMAC_BASE + 0x40)
#define OPENETH_MAC_ADDR1_REG          (EMAC_BASE + 0x44)
#define OPENETH_DESC_BASE              (EMAC_BASE + 0x400)
#define OPENETH_DESC_SIZE              8
#define OPENETH_RX_DESC_INDEX          0x40
#define OPENETH_TX_DESC0_ADDR          (OPENETH_DESC_BASE + 0 * OPENETH_DESC_SIZE)
#define OPENETH_RX_DESC0_ADDR          (OPENETH_DESC_BASE + OPENETH_RX_DESC_INDEX * OPENETH_DESC_SIZE)
#define OPENETH_TX_BUF_BASE            (ESP_GDMA_RAM_ADDR + 0x2000)
#define OPENETH_RX_BUF_BASE            (ESP_GDMA_RAM_ADDR + 0x2100)

#define GPSPI_CMD_UPDATE_BIT    BIT(23)
#define GPSPI_CMD_USR_BIT       BIT(24)
#define GPSPI_INT_TRANS_DONE    BIT(12)
#define USB_SERIAL_JTAG_EP1_DATA_FREE        BIT(1)
#define USB_SERIAL_JTAG_EP1_DATA_AVAIL       BIT(2)
#define USB_SERIAL_JTAG_EP1_WR_DONE         BIT(0)
#define GDMA_SPI2_CHAN          0
#define GDMA_OUT_DESC_SIZE      12
#define GDMA_TX_DATA_BASE       (ESP_GDMA_RAM_ADDR + 0x1000)
#define GDMA_RX_DATA_BASE       (ESP_GDMA_RAM_ADDR + 0x1100)
#define GDMA_TX_DESC_BASE       (ESP_GDMA_RAM_ADDR + 0x1200)
#define GDMA_RX_DESC_BASE       (ESP_GDMA_RAM_ADDR + 0x1300)
#define SHA_DMA_BUF_BASE        (ESP_GDMA_RAM_ADDR + 0x1400)
#define SHA_DMA_DESC_BASE       (ESP_GDMA_RAM_ADDR + 0x1500)

G_STATIC_ASSERT(A_EXTMEM_DCACHE_SYNC_ADDR == A_EXTMEM_DCACHE_SYNC_CTRL + 4);
G_STATIC_ASSERT(A_EXTMEM_DCACHE_SYNC_SIZE == A_EXTMEM_DCACHE_SYNC_ADDR + 4);
G_STATIC_ASSERT(A_EXTMEM_ICACHE_SYNC_ADDR == A_EXTMEM_ICACHE_SYNC_CTRL + 4);
G_STATIC_ASSERT(A_EXTMEM_ICACHE_SYNC_SIZE == A_EXTMEM_ICACHE_SYNC_ADDR + 4);

static QTestState *qts_start(void)
{
    return qtest_init("-M esp32s3");
}

static QTestState *qts_start_smp1(void)
{
    return qtest_init("-M esp32s3 -smp 1");
}

static QTestState *qts_start_with_psram(void)
{
    return qtest_init("-M esp32s3 -m 2M");
}

