skooch/espressif-qemu/tests/qtest/esp32s3-test.c
static QTestState *qts_start_with_openeth(void)
{
    return qtest_init("-M esp32s3 -nic user,id=emac0,model=open_eth");
}

static QTestState *qts_start_without_openeth(void)
{
    return qtest_init("-M esp32s3 -nic none");
}

static void assert_openeth_instantiated(QTestState *qts, bool expected)
{
    g_autofree char *qtree = qtest_hmp(qts, "info qtree");
    bool present = g_strstr_len(qtree, -1, "open_eth") != NULL;

    g_assert_cmpint(present, ==, expected);
}

static void test_generic_mmio_compatibility_storage(void)
{
    QTestState *qts = qts_start();

    g_assert_cmphex(qtest_readl(qts, GENERIC_MMIO_TEST_REG), ==, 0);
    g_assert_cmphex(qtest_readl(qts, GENERIC_MMIO_TEST_REG2), ==, 0);

    qtest_writel(qts, GENERIC_MMIO_TEST_REG, 0x11223344);
    g_assert_cmphex(qtest_readl(qts, GENERIC_MMIO_TEST_REG), ==, 0x11223344);
    g_assert_cmphex(qtest_readl(qts, GENERIC_MMIO_TEST_REG2), ==, 0);

    qtest_writel(qts, GENERIC_MMIO_TEST_REG2, 0xa5a55a5a);
    g_assert_cmphex(qtest_readl(qts, GENERIC_MMIO_TEST_REG), ==, 0x11223344);
    g_assert_cmphex(qtest_readl(qts, GENERIC_MMIO_TEST_REG2), ==, 0xa5a55a5a);

    qtest_quit(qts);
}

static void test_spi0_mem_register_surface(void)
{
    QTestState *qts = qts_start();
    const uint32_t stored_regs[] = {
        A_SPI_MEM_CTRL,
        A_SPI_MEM_CTRL2,
        A_SPI_MEM_CLOCK,
        A_SPI_MEM_USER,
        A_SPI_MEM_USER1,
        A_SPI_MEM_USER2,
        A_SPI_MEM_MOSI_DLEN,
        A_SPI_MEM_MISO_DLEN,
        A_SPI_MEM_MISC,
        A_SPI_MEM_CACHE_FCTRL,
        A_SPI_MEM_CACHE_SCTRL,
        A_SPI_MEM_SRAM_DRD_CMD,
        A_SPI_MEM_SRAM_DWR_CMD,
        A_SPI_MEM_SRAM_CLK,
        A_SPI_MEM_SPI_SMEM_AC,
        A_SPI_MEM_DDR_CTRL,
        A_SPI_MEM_CLOCK_GATE,
        A_SPI_MEM_CORE_CLK_SEL,
    };

    g_assert_cmphex(qtest_readl(qts, SPI0_BASE + A_SPI_MEM_FSM), ==, 0);

    for (int i = 0; i < G_N_ELEMENTS(stored_regs); i++) {
        uint32_t value = 0x5a000000u | (stored_regs[i] << 8) | i;

        qtest_writel(qts, SPI0_BASE + stored_regs[i], value);
        g_assert_cmphex(qtest_readl(qts, SPI0_BASE + stored_regs[i]), ==,
                        value);
    }

    g_assert_cmphex(qtest_readl(qts, SPI0_BASE + A_SPI_MEM_FSM), ==, 0);

    qtest_quit(qts);
}

static void test_assist_debug_register_surface(void)
{
    QTestState *qts = qts_start();
    const uint32_t pdebugenable = ASSIST_DEBUG_BASE + 0x48;
    const uint32_t recording = ASSIST_DEBUG_BASE + 0x4c;
    const uint32_t pdebugpc = ASSIST_DEBUG_BASE + 0x5c;

    g_assert_cmphex(qtest_readl(qts, pdebugenable), ==, 0);
    g_assert_cmphex(qtest_readl(qts, recording), ==, 0);
    g_assert_cmphex(qtest_readl(qts, pdebugpc), ==, 0);

    qtest_writel(qts, pdebugenable, 0x1);
    qtest_writel(qts, recording, 0x2);
    qtest_writel(qts, pdebugpc, 0xffffffff);

    g_assert_cmphex(qtest_readl(qts, pdebugenable), ==, 0x1);
    g_assert_cmphex(qtest_readl(qts, recording), ==, 0x2);
    g_assert_cmphex(qtest_readl(qts, pdebugpc), ==, 0);

    qtest_quit(qts);
}

static void set_gpio_input_level(QTestState *qts, int gpio_num, bool level)
{
    qtest_set_irq_in(qts, "/machine/soc/gpio", ESP32S3_GPIO_INPUT_GPIO,
                     gpio_num, level);
}

#ifndef _WIN32
static QTestState *qts_start_with_flash(const char *flash_path)
{
    return qtest_initf("-M esp32s3 -drive file=%s,format=raw,if=mtd",
                       flash_path);
}

static gchar *create_flash_image_with_patterns(void)
{
    g_autofree gchar *tmp_path = NULL;
    int fd;
    uint32_t word;

    fd = g_file_open_tmp("esp32s3-flash-XXXXXX", &tmp_path, NULL);
    g_assert_cmpint(fd, >=, 0);
    g_assert_cmpint(ftruncate(fd, 2 * 1024 * 1024), ==, 0);

    word = cpu_to_le32(0x11111111);
    g_assert_cmpint(pwrite(fd, &word, sizeof(word), 0), ==, sizeof(word));
    word = cpu_to_le32(0x22222222);
    g_assert_cmpint(pwrite(fd, &word, sizeof(word), ESP32S3_PAGE_SIZE),
                    ==, sizeof(word));

    close(fd);
    return g_steal_pointer(&tmp_path);
}

static void test_cache_flash_mmu_mapping_and_ctrl1_state(void)
{
    g_autofree gchar *flash_path = create_flash_image_with_patterns();
    QTestState *qts = qts_start_with_flash(flash_path);
    const uint32_t mmu_entry0 = DR_REG_EXTMEM_BASE + ESP32S3_MMU_TABLE_OFFSET;
    const uint32_t dcache_ctrl1_bits =
        R_EXTMEM_DCACHE_CTRL1_SHUT_DBUS_MASK |
        R_EXTMEM_DCACHE_CTRL1_SHUT_IBUS_MASK;
    const uint32_t icache_ctrl1_bits =
        R_EXTMEM_ICACHE_CTRL1_SHUT_DBUS_MASK |
        R_EXTMEM_ICACHE_CTRL1_SHUT_IBUS_MASK;

    g_assert_cmphex(qtest_readl(qts, mmu_entry0), ==, BIT(14));

    qtest_writel(qts, mmu_entry0, 0);
    g_assert_cmphex(qtest_readl(qts, 0x3c000000), ==, 0x11111111);

    qtest_writel(qts, mmu_entry0, 1);
    g_assert_cmphex(qtest_readl(qts, 0x3c000000), ==, 0x22222222);

    qtest_writel(qts, DR_REG_EXTMEM_BASE + A_EXTMEM_DCACHE_CTRL1,
                 dcache_ctrl1_bits);
    g_assert_cmphex(qtest_readl(qts, DR_REG_EXTMEM_BASE + A_EXTMEM_DCACHE_CTRL1) &
                    dcache_ctrl1_bits,
                    ==, dcache_ctrl1_bits);

    qtest_writel(qts, DR_REG_EXTMEM_BASE + A_EXTMEM_ICACHE_CTRL1,
                 icache_ctrl1_bits);
    g_assert_cmphex(qtest_readl(qts, DR_REG_EXTMEM_BASE + A_EXTMEM_ICACHE_CTRL1) &
                    icache_ctrl1_bits,
                    ==, icache_ctrl1_bits);

    qtest_quit(qts);
    unlink(flash_path);
}

static void test_cache_psram_mmu_mapping(void)
{
    QTestState *qts = qts_start_with_psram();
    const uint32_t mmu_entry0 = DR_REG_EXTMEM_BASE + ESP32S3_MMU_TABLE_OFFSET;
    const uint32_t psram_page0 = BIT(15);

    g_assert_cmphex(qtest_readl(qts, mmu_entry0), ==, BIT(14));

    qtest_writel(qts, mmu_entry0, psram_page0);
    qtest_writel(qts, ESP32S3_DCACHE_BASE, 0x13572468);
    g_assert_cmphex(qtest_readl(qts, ESP32S3_DCACHE_BASE), ==, 0x13572468);

    qtest_quit(qts);
}

static void assert_cache_deferred_completion(QTestState *qts, uint32_t reg,
                                             uint32_t trigger_bits,
                                             uint32_t ena_mask,
                                             uint32_t done_mask,
                                             uint32_t idle_mask)
{
    uint32_t reg_value;

    qtest_writel(qts, DR_REG_EXTMEM_BASE + reg, trigger_bits);
    reg_value = qtest_readl(qts, DR_REG_EXTMEM_BASE + reg);
    g_assert_cmphex(reg_value & ena_mask, ==, trigger_bits & ena_mask);
    g_assert_cmphex(reg_value & done_mask, ==, 0);
    g_assert_cmphex(qtest_readl(qts, DR_REG_EXTMEM_BASE + A_EXTMEM_CACHE_STATE) &
                    idle_mask,
                    ==, 0);

    qtest_clock_step(qts, CACHE_OP_DELAY_NS - 1);
    reg_value = qtest_readl(qts, DR_REG_EXTMEM_BASE + reg);
    g_assert_cmphex(reg_value & ena_mask, ==, trigger_bits & ena_mask);
    g_assert_cmphex(reg_value & done_mask, ==, 0);

