skooch/espressif-qemu/tests/qtest/esp32s3-test.c
    qtest_clock_step(qts, 1);
    reg_value = qtest_readl(qts, DR_REG_EXTMEM_BASE + reg);
    g_assert_cmphex(reg_value & ena_mask, ==, 0);
    g_assert_cmphex(reg_value & done_mask, ==, done_mask);
    g_assert_cmphex(qtest_readl(qts, DR_REG_EXTMEM_BASE + A_EXTMEM_CACHE_STATE) &
                    idle_mask,
                    ==, idle_mask);
}

static void test_cache_deferred_completion_semantics(void)
{
    QTestState *qts = qts_start();
    const struct {
        uint32_t reg;
        uint32_t trigger_bits;
        uint32_t ena_mask;
        uint32_t done_mask;
        uint32_t idle_mask;
    } cases[] = {
        {
            .reg = A_EXTMEM_DCACHE_SYNC_CTRL,
            .trigger_bits = R_EXTMEM_DCACHE_SYNC_CTRL_INVALIDATE_ENA_MASK,
            .ena_mask = R_EXTMEM_DCACHE_SYNC_CTRL_INVALIDATE_ENA_MASK |
                        R_EXTMEM_DCACHE_SYNC_CTRL_WRITEBACK_ENA_MASK |
                        R_EXTMEM_DCACHE_SYNC_CTRL_CLEAN_ENA_MASK,
            .done_mask = R_EXTMEM_DCACHE_SYNC_CTRL_SYNC_DONE_MASK,
            .idle_mask = 1u << R_EXTMEM_CACHE_STATE_DCACHE_STATE_SHIFT,
        },
        {
            .reg = A_EXTMEM_DCACHE_SYNC_CTRL,
            .trigger_bits = R_EXTMEM_DCACHE_SYNC_CTRL_WRITEBACK_ENA_MASK,
            .ena_mask = R_EXTMEM_DCACHE_SYNC_CTRL_INVALIDATE_ENA_MASK |
                        R_EXTMEM_DCACHE_SYNC_CTRL_WRITEBACK_ENA_MASK |
                        R_EXTMEM_DCACHE_SYNC_CTRL_CLEAN_ENA_MASK,
            .done_mask = R_EXTMEM_DCACHE_SYNC_CTRL_SYNC_DONE_MASK,
            .idle_mask = 1u << R_EXTMEM_CACHE_STATE_DCACHE_STATE_SHIFT,
        },
        {
            .reg = A_EXTMEM_DCACHE_SYNC_CTRL,
            .trigger_bits = R_EXTMEM_DCACHE_SYNC_CTRL_CLEAN_ENA_MASK,
            .ena_mask = R_EXTMEM_DCACHE_SYNC_CTRL_INVALIDATE_ENA_MASK |
                        R_EXTMEM_DCACHE_SYNC_CTRL_WRITEBACK_ENA_MASK |
                        R_EXTMEM_DCACHE_SYNC_CTRL_CLEAN_ENA_MASK,
            .done_mask = R_EXTMEM_DCACHE_SYNC_CTRL_SYNC_DONE_MASK,
            .idle_mask = 1u << R_EXTMEM_CACHE_STATE_DCACHE_STATE_SHIFT,
        },
        {
            .reg = A_EXTMEM_DCACHE_PRELOAD_CTRL,
            .trigger_bits = R_EXTMEM_DCACHE_PRELOAD_CTRL_PRELOAD_ENA_MASK,
            .ena_mask = R_EXTMEM_DCACHE_PRELOAD_CTRL_PRELOAD_ENA_MASK,
            .done_mask = R_EXTMEM_DCACHE_PRELOAD_CTRL_PRELOAD_DONE_MASK,
            .idle_mask = 1u << R_EXTMEM_CACHE_STATE_DCACHE_STATE_SHIFT,
        },
        {
            .reg = A_EXTMEM_DCACHE_AUTOLOAD_CTRL,
            .trigger_bits = R_EXTMEM_DCACHE_AUTOLOAD_CTRL_AUTOLOAD_ENA_MASK |
                            R_EXTMEM_DCACHE_AUTOLOAD_CTRL_AUTOLOAD_SCT0_ENA_MASK,
            .ena_mask = R_EXTMEM_DCACHE_AUTOLOAD_CTRL_AUTOLOAD_ENA_MASK,
            .done_mask = R_EXTMEM_DCACHE_AUTOLOAD_CTRL_AUTOLOAD_DONE_MASK,
            .idle_mask = 1u << R_EXTMEM_CACHE_STATE_DCACHE_STATE_SHIFT,
        },
        {
            .reg = A_EXTMEM_ICACHE_SYNC_CTRL,
            .trigger_bits = R_EXTMEM_ICACHE_SYNC_CTRL_INVALIDATE_ENA_MASK,
            .ena_mask = R_EXTMEM_ICACHE_SYNC_CTRL_INVALIDATE_ENA_MASK,
            .done_mask = R_EXTMEM_ICACHE_SYNC_CTRL_SYNC_DONE_MASK,
            .idle_mask = 1u << R_EXTMEM_CACHE_STATE_ICACHE_STATE_SHIFT,
        },
        {
            .reg = A_EXTMEM_ICACHE_PRELOAD_CTRL,
            .trigger_bits = R_EXTMEM_ICACHE_PRELOAD_CTRL_PRELOAD_ENA_MASK,
            .ena_mask = R_EXTMEM_ICACHE_PRELOAD_CTRL_PRELOAD_ENA_MASK,
            .done_mask = R_EXTMEM_ICACHE_PRELOAD_CTRL_PRELOAD_DONE_MASK,
            .idle_mask = 1u << R_EXTMEM_CACHE_STATE_ICACHE_STATE_SHIFT,
        },
        {
            .reg = A_EXTMEM_ICACHE_AUTOLOAD_CTRL,
            .trigger_bits = R_EXTMEM_ICACHE_AUTOLOAD_CTRL_AUTOLOAD_ENA_MASK |
                            R_EXTMEM_ICACHE_AUTOLOAD_CTRL_AUTOLOAD_SCT0_ENA_MASK,
            .ena_mask = R_EXTMEM_ICACHE_AUTOLOAD_CTRL_AUTOLOAD_ENA_MASK,
            .done_mask = R_EXTMEM_ICACHE_AUTOLOAD_CTRL_AUTOLOAD_DONE_MASK,
            .idle_mask = 1u << R_EXTMEM_CACHE_STATE_ICACHE_STATE_SHIFT,
        },
    };

    for (int i = 0; i < G_N_ELEMENTS(cases); i++) {
        assert_cache_deferred_completion(qts, cases[i].reg,
                                         cases[i].trigger_bits,
                                         cases[i].ena_mask,
                                         cases[i].done_mask,
                                         cases[i].idle_mask);
    }

    qtest_writel(qts, DR_REG_EXTMEM_BASE + A_EXTMEM_DCACHE_FREEZE,
                 R_EXTMEM_DCACHE_FREEZE_DCACHE_FREEZE_ENA_MASK);
    g_assert_cmphex(qtest_readl(qts, DR_REG_EXTMEM_BASE + A_EXTMEM_DCACHE_FREEZE) &
                    R_EXTMEM_DCACHE_FREEZE_DCACHE_FREEZE_DONE_MASK,
                    ==, R_EXTMEM_DCACHE_FREEZE_DCACHE_FREEZE_DONE_MASK);

    qtest_quit(qts);
}

static void test_cache_deferred_ordering_and_clear(void)
{
    QTestState *qts = qts_start();
    const uint32_t dcache_idle =
        1u << R_EXTMEM_CACHE_STATE_DCACHE_STATE_SHIFT;
    const uint32_t icache_idle =
        1u << R_EXTMEM_CACHE_STATE_ICACHE_STATE_SHIFT;
    uint32_t state;

    qtest_writel(qts, DR_REG_EXTMEM_BASE + A_EXTMEM_DCACHE_SYNC_CTRL,
                 R_EXTMEM_DCACHE_SYNC_CTRL_INVALIDATE_ENA_MASK);
    qtest_clock_step(qts, CACHE_OP_DELAY_NS / 2);
    qtest_writel(qts, DR_REG_EXTMEM_BASE + A_EXTMEM_ICACHE_SYNC_CTRL,
                 R_EXTMEM_ICACHE_SYNC_CTRL_INVALIDATE_ENA_MASK);

    qtest_clock_step(qts, CACHE_OP_DELAY_NS / 2 - 1);
    g_assert_cmphex(qtest_readl(qts, DR_REG_EXTMEM_BASE +
                                A_EXTMEM_DCACHE_SYNC_CTRL) &
                    R_EXTMEM_DCACHE_SYNC_CTRL_SYNC_DONE_MASK,
                    ==, 0);
    g_assert_cmphex(qtest_readl(qts, DR_REG_EXTMEM_BASE +
                                A_EXTMEM_ICACHE_SYNC_CTRL) &
                    R_EXTMEM_ICACHE_SYNC_CTRL_SYNC_DONE_MASK,
                    ==, 0);
    state = qtest_readl(qts, DR_REG_EXTMEM_BASE + A_EXTMEM_CACHE_STATE);
    g_assert_cmphex(state & dcache_idle, ==, 0);
    g_assert_cmphex(state & icache_idle, ==, 0);

