skooch/espressif-qemu/tests/qtest/esp32s3-test.c
    qtest_clock_step(qts, 1);
    g_assert_cmphex(qtest_readl(qts, DR_REG_EXTMEM_BASE +
                                A_EXTMEM_DCACHE_SYNC_CTRL) &
                    R_EXTMEM_DCACHE_SYNC_CTRL_SYNC_DONE_MASK,
                    ==, R_EXTMEM_DCACHE_SYNC_CTRL_SYNC_DONE_MASK);
    g_assert_cmphex(qtest_readl(qts, DR_REG_EXTMEM_BASE +
                                A_EXTMEM_ICACHE_SYNC_CTRL) &
                    R_EXTMEM_ICACHE_SYNC_CTRL_SYNC_DONE_MASK,
                    ==, 0);
    state = qtest_readl(qts, DR_REG_EXTMEM_BASE + A_EXTMEM_CACHE_STATE);
    g_assert_cmphex(state & dcache_idle, ==, dcache_idle);
    g_assert_cmphex(state & icache_idle, ==, 0);

    qtest_clock_step(qts, CACHE_OP_DELAY_NS / 2);
    g_assert_cmphex(qtest_readl(qts, DR_REG_EXTMEM_BASE +
                                A_EXTMEM_ICACHE_SYNC_CTRL) &
                    R_EXTMEM_ICACHE_SYNC_CTRL_SYNC_DONE_MASK,
                    ==, R_EXTMEM_ICACHE_SYNC_CTRL_SYNC_DONE_MASK);
    state = qtest_readl(qts, DR_REG_EXTMEM_BASE + A_EXTMEM_CACHE_STATE);
    g_assert_cmphex(state & dcache_idle, ==, dcache_idle);
    g_assert_cmphex(state & icache_idle, ==, icache_idle);

    qtest_writel(qts, DR_REG_EXTMEM_BASE + A_EXTMEM_DCACHE_PRELOAD_CTRL,
                 R_EXTMEM_DCACHE_PRELOAD_CTRL_PRELOAD_ENA_MASK);
    g_assert_cmphex(qtest_readl(qts, DR_REG_EXTMEM_BASE +
                                A_EXTMEM_DCACHE_PRELOAD_CTRL) &
                    R_EXTMEM_DCACHE_PRELOAD_CTRL_PRELOAD_DONE_MASK,
                    ==, 0);
    qtest_writel(qts, DR_REG_EXTMEM_BASE + A_EXTMEM_DCACHE_PRELOAD_CTRL, 0);
    qtest_clock_step(qts, CACHE_OP_DELAY_NS);
    g_assert_cmphex(qtest_readl(qts, DR_REG_EXTMEM_BASE +
                                A_EXTMEM_DCACHE_PRELOAD_CTRL) &
                    (R_EXTMEM_DCACHE_PRELOAD_CTRL_PRELOAD_ENA_MASK |
                     R_EXTMEM_DCACHE_PRELOAD_CTRL_PRELOAD_DONE_MASK),
                    ==, 0);

    qtest_quit(qts);
}

static void test_cache_fault_preserved_across_deferred_ops(void)
{
    QTestState *qts = qts_start();
    uint32_t fault_content;
    uint32_t fault_vaddr;

    qtest_writel(qts, DR_REG_EXTMEM_BASE + A_EXTMEM_CACHE_ILG_INT_ENA,
                 R_EXTMEM_CACHE_ILG_INT_ENA_MMU_ENTRY_FAULT_INT_ENA_MASK);
    (void) qtest_readl(qts, ESP32S3_DCACHE_BASE);

    fault_content = qtest_readl(qts, DR_REG_EXTMEM_BASE +
                                A_EXTMEM_CACHE_MMU_FAULT_CONTENT);
    fault_vaddr = qtest_readl(qts, DR_REG_EXTMEM_BASE +
                              A_EXTMEM_CACHE_MMU_FAULT_VADDR);
    g_assert_cmphex(qtest_readl(qts, DR_REG_EXTMEM_BASE +
                                A_EXTMEM_CACHE_ILG_INT_ST) &
                    R_EXTMEM_CACHE_ILG_INT_ST_MMU_ENTRY_FAULT_ST_MASK,
                    ==, R_EXTMEM_CACHE_ILG_INT_ST_MMU_ENTRY_FAULT_ST_MASK);

    qtest_writel(qts, DR_REG_EXTMEM_BASE + A_EXTMEM_DCACHE_SYNC_CTRL,
                 R_EXTMEM_DCACHE_SYNC_CTRL_INVALIDATE_ENA_MASK);
    qtest_writel(qts, DR_REG_EXTMEM_BASE + A_EXTMEM_DCACHE_PRELOAD_CTRL,
                 R_EXTMEM_DCACHE_PRELOAD_CTRL_PRELOAD_ENA_MASK);
    qtest_clock_step(qts, CACHE_OP_DELAY_NS);

    g_assert_cmphex(qtest_readl(qts, DR_REG_EXTMEM_BASE +
                                A_EXTMEM_CACHE_ILG_INT_ST) &
                    R_EXTMEM_CACHE_ILG_INT_ST_MMU_ENTRY_FAULT_ST_MASK,
                    ==, R_EXTMEM_CACHE_ILG_INT_ST_MMU_ENTRY_FAULT_ST_MASK);
    g_assert_cmphex(qtest_readl(qts, DR_REG_EXTMEM_BASE +
                                A_EXTMEM_CACHE_MMU_FAULT_CONTENT),
                    ==, fault_content);
    g_assert_cmphex(qtest_readl(qts, DR_REG_EXTMEM_BASE +
                                A_EXTMEM_CACHE_MMU_FAULT_VADDR),
                    ==, fault_vaddr);

    qtest_writel(qts, DR_REG_EXTMEM_BASE + A_EXTMEM_CACHE_ILG_INT_CLR,
                 R_EXTMEM_CACHE_ILG_INT_CLR_MMU_ENTRY_FAULT_INT_CLR_MASK);
    g_assert_cmphex(qtest_readl(qts, DR_REG_EXTMEM_BASE +
                                A_EXTMEM_CACHE_MMU_FAULT_CONTENT),
                    ==, 0);
    g_assert_cmphex(qtest_readl(qts, DR_REG_EXTMEM_BASE +
                                A_EXTMEM_CACHE_MMU_FAULT_VADDR),
                    ==, 0);

    qtest_quit(qts);
}

static void test_cache_invalid_mmu_fault_irq(void)
{
    QTestState *qts = qts_start();
    const uint32_t mmu_entry0 = DR_REG_EXTMEM_BASE + ESP32S3_MMU_TABLE_OFFSET;
    uint32_t fault_content;

    qtest_irq_intercept_in(qts, "/machine/soc/intmatrix");

    g_assert_cmphex(qtest_readl(qts, mmu_entry0), ==, BIT(14));
    g_assert_false(qtest_get_irq(qts, ESP32S3_CACHE_IA_SOURCE));
    g_assert_cmphex(qtest_readl(qts, DR_REG_EXTMEM_BASE + A_EXTMEM_CACHE_ILG_INT_ST),
                    ==, 0);

    qtest_writel(qts, DR_REG_EXTMEM_BASE + A_EXTMEM_CACHE_ILG_INT_ENA,
                 R_EXTMEM_CACHE_ILG_INT_ENA_MMU_ENTRY_FAULT_INT_ENA_MASK);
    g_assert_cmphex(qtest_readl(qts, DR_REG_EXTMEM_BASE + A_EXTMEM_CACHE_ILG_INT_ENA) &
                    R_EXTMEM_CACHE_ILG_INT_ENA_MMU_ENTRY_FAULT_INT_ENA_MASK,
                    ==, R_EXTMEM_CACHE_ILG_INT_ENA_MMU_ENTRY_FAULT_INT_ENA_MASK);

    (void) qtest_readl(qts, ESP32S3_DCACHE_BASE);

    g_assert_cmphex(qtest_readl(qts, DR_REG_EXTMEM_BASE + A_EXTMEM_CACHE_ILG_INT_ST) &
                    R_EXTMEM_CACHE_ILG_INT_ST_MMU_ENTRY_FAULT_ST_MASK,
                    ==, R_EXTMEM_CACHE_ILG_INT_ST_MMU_ENTRY_FAULT_ST_MASK);
    fault_content = qtest_readl(qts,
                                DR_REG_EXTMEM_BASE +
                                A_EXTMEM_CACHE_MMU_FAULT_CONTENT);
    g_assert_cmpuint(FIELD_EX32(fault_content, EXTMEM_CACHE_MMU_FAULT_CONTENT,
                                CACHE_MMU_FAULT_CODE), ==, 1);
    g_assert_cmpuint(FIELD_EX32(fault_content, EXTMEM_CACHE_MMU_FAULT_CONTENT,
                                CACHE_MMU_FAULT_CONTENT), ==, BIT(14));
    g_assert_cmphex(qtest_readl(qts, DR_REG_EXTMEM_BASE +
                                A_EXTMEM_CACHE_MMU_FAULT_VADDR),
                    ==, ESP32S3_DCACHE_BASE);
    g_assert_true(qtest_get_irq(qts, ESP32S3_CACHE_IA_SOURCE));

    qtest_writel(qts, DR_REG_EXTMEM_BASE + A_EXTMEM_CACHE_ILG_INT_CLR,
                 R_EXTMEM_CACHE_ILG_INT_CLR_MMU_ENTRY_FAULT_INT_CLR_MASK);
    g_assert_cmphex(qtest_readl(qts, DR_REG_EXTMEM_BASE + A_EXTMEM_CACHE_ILG_INT_ST) &
                    R_EXTMEM_CACHE_ILG_INT_ST_MMU_ENTRY_FAULT_ST_MASK,
                    ==, 0);
    g_assert_cmphex(qtest_readl(qts, DR_REG_EXTMEM_BASE +
                                A_EXTMEM_CACHE_MMU_FAULT_CONTENT),
                    ==, 0);
    g_assert_cmphex(qtest_readl(qts, DR_REG_EXTMEM_BASE +
                                A_EXTMEM_CACHE_MMU_FAULT_VADDR),
                    ==, 0);
    g_assert_false(qtest_get_irq(qts, ESP32S3_CACHE_IA_SOURCE));

