skooch/espressif-qemu/tests/qtest/esp32s3-test.c
    qtest_quit(qts);
}

static void assert_cache_core0_reject_irq(QTestState *qts, uint32_t access_addr,
                                          uint32_t enable_mask,
                                          uint32_t status_mask,
                                          uint32_t clear_mask,
                                          uint32_t reject_st_addr,
                                          uint32_t reject_vaddr_addr,
                                          uint32_t expected_attr,
                                          uint32_t expected_tag)
{
    uint32_t reject_desc;

    qtest_writel(qts, DR_REG_EXTMEM_BASE + A_EXTMEM_CORE0_ACS_CACHE_INT_ENA,
                 enable_mask);
    g_assert_false(qtest_get_irq(qts, ESP32S3_CACHE_CORE0_ACS_SOURCE));

    qtest_writel(qts, access_addr, 0xa5a5a5a5);

    g_assert_cmphex(qtest_readl(qts, DR_REG_EXTMEM_BASE + A_EXTMEM_CORE0_ACS_CACHE_INT_ST) &
                    status_mask, ==, status_mask);
    reject_desc = qtest_readl(qts, DR_REG_EXTMEM_BASE + reject_st_addr);
    g_assert_cmpuint(extract32(reject_desc, 6, 1), ==, 0);
    g_assert_cmpuint(extract32(reject_desc, 3, 3), ==, expected_attr);
    g_assert_cmpuint(extract32(reject_desc, 0, 3), ==, expected_tag);
    g_assert_cmphex(qtest_readl(qts, DR_REG_EXTMEM_BASE + reject_vaddr_addr),
                    ==, access_addr);
    g_assert_true(qtest_get_irq(qts, ESP32S3_CACHE_CORE0_ACS_SOURCE));

    qtest_writel(qts, DR_REG_EXTMEM_BASE + A_EXTMEM_CORE0_ACS_CACHE_INT_CLR,
                 clear_mask);
    g_assert_cmphex(qtest_readl(qts, DR_REG_EXTMEM_BASE + A_EXTMEM_CORE0_ACS_CACHE_INT_ST) &
                    status_mask, ==, 0);
    g_assert_cmphex(qtest_readl(qts, DR_REG_EXTMEM_BASE + reject_st_addr), ==, 0);
    g_assert_cmphex(qtest_readl(qts, DR_REG_EXTMEM_BASE + reject_vaddr_addr),
                    ==, UINT32_MAX);
    g_assert_false(qtest_get_irq(qts, ESP32S3_CACHE_CORE0_ACS_SOURCE));
}

static void test_cache_core0_dbus_reject_irq(void)
{
    g_autofree gchar *flash_path = create_flash_image_with_patterns();
    QTestState *qts = qts_start_with_flash(flash_path);
    const uint32_t mmu_entry0 = DR_REG_EXTMEM_BASE + ESP32S3_MMU_TABLE_OFFSET;

    qtest_irq_intercept_in(qts, "/machine/soc/intmatrix");
    qtest_writel(qts, mmu_entry0, 0);

    assert_cache_core0_reject_irq(qts, ESP32S3_DCACHE_BASE,
                                  R_EXTMEM_CORE0_ACS_CACHE_INT_ENA_CORE0_DBUS_REJECT_INT_ENA_MASK,
                                  R_EXTMEM_CORE0_ACS_CACHE_INT_ST_CORE0_DBUS_REJECT_ST_MASK,
                                  R_EXTMEM_CORE0_ACS_CACHE_INT_CLR_CORE0_DBUS_REJECT_INT_CLR_MASK,
                                  A_EXTMEM_CORE0_DBUS_REJECT_ST,
                                  A_EXTMEM_CORE0_DBUS_REJECT_VADDR,
                                  4, 2);

    qtest_quit(qts);
    unlink(flash_path);
}

static void test_cache_core0_ibus_reject_irq(void)
{
    g_autofree gchar *flash_path = create_flash_image_with_patterns();
    QTestState *qts = qts_start_with_flash(flash_path);
    const uint32_t mmu_entry0 = DR_REG_EXTMEM_BASE + ESP32S3_MMU_TABLE_OFFSET;

    qtest_irq_intercept_in(qts, "/machine/soc/intmatrix");
    qtest_writel(qts, mmu_entry0, 0);

    assert_cache_core0_reject_irq(qts, ESP32S3_ICACHE_BASE,
                                  R_EXTMEM_CORE0_ACS_CACHE_INT_ENA_CORE0_IBUS_REJECT_INT_ENA_MASK,
                                  R_EXTMEM_CORE0_ACS_CACHE_INT_ST_CORE0_IBUS_REJECT_ST_MASK,
                                  R_EXTMEM_CORE0_ACS_CACHE_INT_CLR_CORE0_IBUS_REJECT_INT_CLR_MASK,
                                  A_EXTMEM_CORE0_IBUS_REJECT_ST,
                                  A_EXTMEM_CORE0_IBUS_REJECT_VADDR,
                                  4, 1);

    qtest_quit(qts);
    unlink(flash_path);
}
#endif

static void test_ana_pll_done(void)
{
    QTestState *qts = qts_start();

    g_assert_cmphex(qtest_readl(qts, ANA_BASE + 0x40) & BIT(24), ==, BIT(24));

    qtest_writel(qts, ANA_BASE + 0x44, 0x12345678);
    g_assert_cmphex(qtest_readl(qts, ANA_BASE + 0x44), ==, 0x12345678);

    qtest_quit(qts);
}

static void test_apb_ctrl_register_surface(void)
{
    QTestState *qts = qts_start();

    g_assert_cmphex(qtest_readl(qts, APB_CTRL_DATE_REG), ==,
                    APB_CTRL_DATE_VALUE);
    g_assert_cmphex(qtest_readl(qts, APB_CTRL_QEMU_ORIGIN_REG), ==,
                    APB_CTRL_QEMU_ORIGIN);
    g_assert_cmphex(qtest_readl(qts, APB_CTRL_LEGACY_ECO3_DATE_REG), ==,
                    APB_CTRL_LEGACY_ECO3_DATE);
    g_assert_cmphex(qtest_readl(qts, APB_CTRL_LEGACY_ECO3_DATE_REG) & BIT(31),
                    ==, BIT(31));

    qtest_writel(qts, APB_CTRL_DATE_REG, 0);
    qtest_writel(qts, APB_CTRL_QEMU_ORIGIN_REG, 0);
    qtest_writel(qts, APB_CTRL_LEGACY_ECO3_DATE_REG, 0);
    qtest_writel(qts, APB_CTRL_UNSUPPORTED_REG, 0xffffffff);

    g_assert_cmphex(qtest_readl(qts, APB_CTRL_DATE_REG), ==,
                    APB_CTRL_DATE_VALUE);
    g_assert_cmphex(qtest_readl(qts, APB_CTRL_QEMU_ORIGIN_REG), ==,
                    APB_CTRL_QEMU_ORIGIN);
    g_assert_cmphex(qtest_readl(qts, APB_CTRL_LEGACY_ECO3_DATE_REG), ==,
                    APB_CTRL_LEGACY_ECO3_DATE);
    g_assert_cmphex(qtest_readl(qts, APB_CTRL_UNSUPPORTED_REG), ==, 0);

    qtest_quit(qts);
}

static void test_single_cpu_boot(void)
{
    QTestState *qts = qts_start_smp1();

    g_assert_cmphex(qtest_readl(qts, ANA_BASE + 0x40) & BIT(24), ==, BIT(24));

    qtest_quit(qts);
}

static void test_gpio_and_iomux_state(void)
{
    QTestState *qts = qts_start();

    g_assert_cmphex(qtest_readl(qts, GPIO_BASE + GPIO_FUNC_OUT_SEL_CFG_REG(34)),
                    ==, ESP32S3_GPIO_SIG_GPIO_OUT);
    g_assert_cmphex((qtest_readl(qts, IOMUX_BASE + ESP32S3_IOMUX_GPIO_REG(34)) &
                     ESP32S3_IOMUX_MCU_SEL_MASK) >> ESP32S3_IOMUX_MCU_SEL_SHIFT,
                    ==, ESP32S3_GPIO_IOMUX_FUNC_GPIO);

    qtest_writel(qts, GPIO_BASE + GPIO_STATUS_W1TS_REG, BIT(5));
    qtest_clock_step(qts, 1000);
    g_assert_cmphex(qtest_readl(qts, GPIO_BASE + GPIO_STATUS_REG), ==, BIT(5));

    qtest_writel(qts, GPIO_BASE + GPIO_STATUS_W1TC_REG, BIT(5));
    g_assert_cmphex(qtest_readl(qts, GPIO_BASE + GPIO_STATUS_REG), ==, 0);

