skooch/espressif-qemu/tests/qtest/esp32s3-test.c
    qtest_writel(qts, IOMUX_BASE + ESP32S3_IOMUX_GPIO_REG(34), 0);
    g_assert_cmphex((qtest_readl(qts, IOMUX_BASE + ESP32S3_IOMUX_GPIO_REG(34)) &
                     ESP32S3_IOMUX_MCU_SEL_MASK) >> ESP32S3_IOMUX_MCU_SEL_SHIFT,
                    ==, ESP32S3_GPIO_IOMUX_FUNC_DIRECT);

    qtest_quit(qts);
}

static void test_gpspi_completion_irq(void)
{
    QTestState *qts = qts_start();

    qtest_writel(qts, SPI2_BASE + 0x34, GPSPI_INT_TRANS_DONE);
    qtest_writel(qts, SPI2_BASE + 0x00, GPSPI_CMD_USR_BIT | GPSPI_CMD_UPDATE_BIT);

    g_assert_cmphex(qtest_readl(qts, SPI2_BASE + 0x00), ==, GPSPI_CMD_USR_BIT);
    g_assert_cmphex(qtest_readl(qts, SPI2_BASE + 0x3c), ==, 0);
    g_assert_cmphex(qtest_readl(qts, SPI2_BASE + 0x40), ==, 0);

    qtest_clock_step(qts, 700);
    g_assert_cmphex(qtest_readl(qts, SPI2_BASE + 0x00), ==, GPSPI_CMD_USR_BIT);
    g_assert_cmphex(qtest_readl(qts, SPI2_BASE + 0x3c), ==, 0);
    g_assert_cmphex(qtest_readl(qts, SPI2_BASE + 0x40), ==, 0);

    qtest_clock_step(qts, 800);
    g_assert_cmphex(qtest_readl(qts, SPI2_BASE + 0x00), ==, GPSPI_CMD_USR_BIT);
    g_assert_cmphex(qtest_readl(qts, SPI2_BASE + 0x3c), ==, 0);
    g_assert_cmphex(qtest_readl(qts, SPI2_BASE + 0x40), ==, 0);

    qtest_clock_step(qts, 800);

    g_assert_cmphex(qtest_readl(qts, SPI2_BASE + 0x00), ==, 0);
    g_assert_cmphex(qtest_readl(qts, SPI2_BASE + 0x3c), ==, GPSPI_INT_TRANS_DONE);
    g_assert_cmphex(qtest_readl(qts, SPI2_BASE + 0x40), ==, GPSPI_INT_TRANS_DONE);

    qtest_writel(qts, SPI2_BASE + 0x38, GPSPI_INT_TRANS_DONE);
    g_assert_cmphex(qtest_readl(qts, SPI2_BASE + 0x40), ==, 0);

    qtest_quit(qts);
}

static void test_gpio_signal_remap_state(void)
{
    QTestState *qts = qts_start();

    qtest_writel(qts, GPIO_BASE + GPIO_FUNC_OUT_SEL_CFG_REG(34),
                 ESP32S3_GPIO_SIG_GPIO_OUT);

    qtest_writel(qts, IOMUX_BASE + ESP32S3_IOMUX_GPIO_REG(7),
                 ESP32S3_GPIO_IOMUX_FUNC_GPIO << ESP32S3_IOMUX_MCU_SEL_SHIFT);
    qtest_writel(qts, GPIO_BASE + GPIO_FUNC_OUT_SEL_CFG_REG(7), ESP32S3_GPIO_SIG_EPD_CS);
    qtest_writel(qts, IOMUX_BASE + ESP32S3_IOMUX_GPIO_REG(34),
                 ESP32S3_GPIO_IOMUX_FUNC_DIRECT << ESP32S3_IOMUX_MCU_SEL_SHIFT);

    g_assert_cmphex(qtest_readl(qts, GPIO_BASE + GPIO_FUNC_OUT_SEL_CFG_REG(7)),
                    ==, ESP32S3_GPIO_SIG_EPD_CS);
    g_assert_cmphex((qtest_readl(qts, IOMUX_BASE + ESP32S3_IOMUX_GPIO_REG(34)) &
                     ESP32S3_IOMUX_MCU_SEL_MASK) >> ESP32S3_IOMUX_MCU_SEL_SHIFT,
                    ==, ESP32S3_GPIO_IOMUX_FUNC_DIRECT);
    g_assert_cmphex((qtest_readl(qts, IOMUX_BASE + ESP32S3_IOMUX_GPIO_REG(7)) &
                     ESP32S3_IOMUX_MCU_SEL_MASK) >> ESP32S3_IOMUX_MCU_SEL_SHIFT,
                    ==, ESP32S3_GPIO_IOMUX_FUNC_GPIO);

    qtest_quit(qts);
}

static void test_gpio_signal_non_default_routing(void)
{
    QTestState *qts = qts_start();

    qtest_writel(qts, GPIO_BASE + GPIO_FUNC_OUT_SEL_CFG_REG(34),
                 ESP32S3_GPIO_SIG_SD_CS);
    qtest_writel(qts, GPIO_BASE + GPIO_FUNC_OUT_SEL_CFG_REG(7),
                 ESP32S3_GPIO_SIG_EPD_CS);
    qtest_writel(qts, IOMUX_BASE + ESP32S3_IOMUX_GPIO_REG(7),
                 ESP32S3_GPIO_IOMUX_FUNC_GPIO << ESP32S3_IOMUX_MCU_SEL_SHIFT);
    g_assert_cmphex(qtest_readl(qts, GPIO_BASE + GPIO_FUNC_OUT_SEL_CFG_REG(34)),
                    ==, ESP32S3_GPIO_SIG_SD_CS);
    g_assert_cmphex(qtest_readl(qts, GPIO_BASE + GPIO_FUNC_OUT_SEL_CFG_REG(7)),
                    ==, ESP32S3_GPIO_SIG_EPD_CS);

    qtest_writel(qts, GPIO_BASE + GPIO_FUNC_OUT_SEL_CFG_REG(34),
                 ESP32S3_GPIO_SIG_GPIO_OUT);
    qtest_writel(qts, IOMUX_BASE + ESP32S3_IOMUX_GPIO_REG(7),
                 ESP32S3_GPIO_IOMUX_FUNC_DIRECT << ESP32S3_IOMUX_MCU_SEL_SHIFT);
    g_assert_cmphex((qtest_readl(qts, IOMUX_BASE + ESP32S3_IOMUX_GPIO_REG(7)) &
                     ESP32S3_IOMUX_MCU_SEL_MASK) >> ESP32S3_IOMUX_MCU_SEL_SHIFT,
                    ==, 0);
    g_assert_cmphex(qtest_readl(qts, GPIO_BASE + GPIO_FUNC_OUT_SEL_CFG_REG(7)),
                    ==, ESP32S3_GPIO_SIG_EPD_CS);

    qtest_writel(qts, GPIO_BASE + GPIO_FUNC_OUT_SEL_CFG_REG(7),
                 ESP32S3_GPIO_SIG_GPIO_OUT);
    qtest_writel(qts, GPIO_BASE + GPIO_OUT1_REG, BIT(2));
    qtest_writel(qts, GPIO_BASE + GPIO_OUT_REG, BIT(7));
    qtest_writel(qts, GPIO_BASE + GPIO_ENABLE1_REG, BIT(2));
    qtest_writel(qts, GPIO_BASE + GPIO_ENABLE_REG, BIT(7));

    g_assert_cmphex(qtest_readl(qts, GPIO_BASE + GPIO_OUT_REG) & BIT(7), ==, BIT(7));
    g_assert_cmphex(qtest_readl(qts, GPIO_BASE + GPIO_OUT1_REG) & BIT(2), ==, BIT(2));
    qtest_writel(qts, GPIO_BASE + GPIO_OUT1_W1TC_REG, BIT(2));
    g_assert_cmphex(qtest_readl(qts, GPIO_BASE + GPIO_OUT1_REG) & BIT(2),
                    ==, 0);
    qtest_writel(qts, GPIO_BASE + GPIO_OUT_W1TC_REG, BIT(7));
    g_assert_cmphex(qtest_readl(qts, GPIO_BASE + GPIO_OUT_REG) & BIT(7),
                    ==, 0);

    qtest_quit(qts);
}

static void test_spi1_usr_rx_overwrites_all_bytes(void)
{
    QTestState *qts = qts_start();
    uint32_t w0;

    qtest_writel(qts, SPI1_BASE + A_SPI_MEM_USER,
                 R_SPI_MEM_USER_USR_MOSI_MASK | R_SPI_MEM_USER_USR_MISO_MASK);
    qtest_writel(qts, SPI1_BASE + A_SPI_MEM_MOSI_DLEN, 31);
    qtest_writel(qts, SPI1_BASE + A_SPI_MEM_MISO_DLEN, 31);
    qtest_writel(qts, SPI1_BASE + A_SPI_MEM_W0, 0xfdfe0201);
    qtest_writel(qts, SPI1_BASE + A_SPI_MEM_CMD, R_SPI_MEM_CMD_USR_MASK);

    w0 = qtest_readl(qts, SPI1_BASE + A_SPI_MEM_W0);
    g_assert_cmphex(w0 >> 16, !=, 0xfdfe);

    qtest_quit(qts);
}

static uint32_t spi1_bytes_from_bits(uint32_t bit_len)
{
    return (bit_len + 1) / 8;
}

typedef struct TestGdmaLinkedList {
    union {
        struct {
            uint32_t size: 12;
            uint32_t length: 12;
            uint32_t rsvd_24: 4;
            uint32_t err_eof: 1;
            uint32_t rsvd_29: 1;
            uint32_t suc_eof: 1;
            uint32_t owner: 1;
        } bits;
        uint32_t val;
    } config;
    uint32_t buf_addr;
    uint32_t next_addr;
} TestGdmaLinkedList;

