skooch/espressif-qemu/tests/qtest/esp32s3-test.c
static void test_spi1_usr_length_matrix(void)
{
    QTestState *qts = qts_start();
    const struct {
        uint32_t mosi_bits;
        uint32_t miso_bits;
    } cases[] = {
        {7, 0},
        {0, 7},
        {15, 15},
        {31, 0},
        {0, 31},
        {31, 15},
    };

    qtest_writel(qts, SPI1_BASE + A_SPI_MEM_USER,
                 R_SPI_MEM_USER_USR_COMMAND_MASK |
                 R_SPI_MEM_USER_USR_MOSI_MASK |
                 R_SPI_MEM_USER_USR_MISO_MASK);

    for (int i = 0; i < G_N_ELEMENTS(cases); i++) {
        const uint32_t mosi_bits = cases[i].mosi_bits;
        const uint32_t miso_bits = cases[i].miso_bits;
        const uint32_t expected_rx = spi1_bytes_from_bits(miso_bits);
        const uint32_t sentinel = 0xA5A5A5A5;

        qtest_writel(qts, SPI1_BASE + A_SPI_MEM_W0, sentinel);

        qtest_writel(qts, SPI1_BASE + A_SPI_MEM_MOSI_DLEN,
                     FIELD_DP32(0, SPI_MEM_MOSI_DLEN, USR_MOSI_DBITLEN,
                                mosi_bits));
        qtest_writel(qts, SPI1_BASE + A_SPI_MEM_MISO_DLEN,
                     FIELD_DP32(0, SPI_MEM_MISO_DLEN, USR_MISO_DBITLEN,
                                miso_bits));
        qtest_writel(qts, SPI1_BASE + A_SPI_MEM_CMD,
                     R_SPI_MEM_CMD_USR_MASK);

        if (expected_rx == 0) {
            g_assert_cmphex(qtest_readl(qts, SPI1_BASE + A_SPI_MEM_W0), ==, sentinel);
        } else {
            g_assert_cmphex(qtest_readl(qts, SPI1_BASE + A_SPI_MEM_W0), !=, sentinel);
        }
    }

    qtest_writel(qts, SPI1_BASE + A_SPI_MEM_MOSI_DLEN, 0);
    qtest_writel(qts, SPI1_BASE + A_SPI_MEM_MISO_DLEN, 0);

    qtest_quit(qts);
}

static void test_spi1_cmd_length_edges(void)
{
    QTestState *qts = qts_start();
    uint8_t w0_data[8] = {0};

    qtest_writel(qts, SPI1_BASE + A_SPI_MEM_W0, 0xA5A5A5A5);
    qtest_writel(qts, SPI1_BASE + A_SPI_MEM_W1, 0xA5A5A5A5);
    qtest_writel(qts, SPI1_BASE + A_SPI_MEM_CMD, R_SPI_MEM_CMD_FLASH_RDID_MASK);
    qtest_memread(qts, SPI1_BASE + A_SPI_MEM_W0, w0_data, 3);
    g_assert_cmpuint(w0_data[0], !=, 0xA5);
    g_assert_cmpuint(w0_data[1], !=, 0xA5);
    g_assert_cmpuint(w0_data[2], !=, 0xA5);

    qtest_writel(qts, SPI1_BASE + A_SPI_MEM_RD_STATUS, 0xA5A5A5A5);
    qtest_writel(qts, SPI1_BASE + A_SPI_MEM_CMD, R_SPI_MEM_CMD_FLASH_RDSR_MASK);
    g_assert_cmpuint(qtest_readl(qts, SPI1_BASE + A_SPI_MEM_RD_STATUS) & 0xff,
                     !=, 0xA5);
    g_assert_cmphex(qtest_readl(qts, SPI1_BASE + A_SPI_MEM_RD_STATUS) & 0xffffff00,
                    ==, 0xA5A5A500);

    qtest_quit(qts);
}

static void write_gdma_descriptor(QTestState *qts, uint32_t addr,
                                 uint32_t size, uint32_t length,
                                 bool suc_eof, bool owner,
                                 uint32_t buffer_addr, uint32_t next_addr)
{
    TestGdmaLinkedList desc = { 0 };

    desc.config.bits.size = size;
    desc.config.bits.length = length;
    desc.config.bits.suc_eof = suc_eof;
    desc.config.bits.owner = owner;
    desc.buf_addr = buffer_addr;
    desc.next_addr = next_addr;

    qtest_memwrite(qts, addr, &desc, sizeof(desc));
}

static uint32_t sha_dma_buf_addr(uint32_t block_len)
{
    return SHA_DMA_BUF_BASE;
}

static void test_gpspi_dma_txrx_handoff(void)
{
    QTestState *qts = qts_start();
    const uint32_t tx_len = 4;
    const uint32_t rx_len = 4;
    const uint32_t tx_buf = GDMA_TX_DATA_BASE;
    const uint32_t rx_buf = GDMA_RX_DATA_BASE;
    const uint32_t tx_desc = GDMA_TX_DESC_BASE;
    const uint32_t rx_desc = GDMA_RX_DESC_BASE;
    const uint32_t in_dir_base = GDMA_SPI2_CHAN * DMA_CHAN_REGS_SIZE
                               + ESP_GDMA_IN_IDX * DMA_DIR_REGS_SIZE;
    const uint32_t out_dir_base = GDMA_SPI2_CHAN * DMA_CHAN_REGS_SIZE
                               + ESP_GDMA_OUT_IDX * DMA_DIR_REGS_SIZE;
    const uint8_t tx_payload[4] = { 0x11, 0x22, 0x33, 0x44 };
    const uint8_t zero[4] = { 0 };

    qtest_memwrite(qts, tx_buf, tx_payload, sizeof(tx_payload));
    qtest_memwrite(qts, rx_buf, zero, sizeof(zero));

    write_gdma_descriptor(qts, tx_desc, tx_len, tx_len, true, false,
                          tx_buf, 0);
    write_gdma_descriptor(qts, rx_desc, rx_len, 0, false, false,
                          rx_buf, 0);

    qtest_writel(qts, GDMA_BASE + in_dir_base + A_DMA_PERI_SEL,
                 FIELD_DP32(0, GDMA_PERI_SEL, PERI_SEL, GDMA_SPI2));
    qtest_writel(qts, GDMA_BASE + out_dir_base + A_DMA_PERI_SEL,
                 FIELD_DP32(0, GDMA_PERI_SEL, PERI_SEL, GDMA_SPI2));

    qtest_writel(qts, GDMA_BASE + in_dir_base + A_DMA_LINK,
                 R_GDMA_IN_LINK_START_MASK | (rx_desc & R_GDMA_IN_LINK_ADDR_MASK));
    qtest_writel(qts, GDMA_BASE + out_dir_base + A_DMA_LINK,
                 R_GDMA_OUT_LINK_START_MASK | (tx_desc & R_GDMA_OUT_LINK_ADDR_MASK));

    qtest_writel(qts, IOMUX_BASE + ESP32S3_IOMUX_GPIO_REG(48),
                 ESP32S3_GPIO_IOMUX_FUNC_GPIO << ESP32S3_IOMUX_MCU_SEL_SHIFT);
    qtest_writel(qts, GPIO_BASE + GPIO_FUNC_OUT_SEL_CFG_REG(48),
                 ESP32S3_GPIO_SIG_SD_CS);
    qtest_writel(qts, GPIO_BASE + GPIO_ENABLE1_W1TS_REG, BIT(16));
    qtest_writel(qts, GPIO_BASE + GPIO_OUT1_W1TC_REG, BIT(16));
    g_assert_cmphex(qtest_readl(qts, GPIO_BASE + GPIO_IN1_REG) & BIT(16),
                    ==, 0);

    qtest_writel(qts, SPI2_BASE + 0x10,
                 (1u << 27) | (1u << 28)); /* USR_MOSI/MISO */
    qtest_writel(qts, SPI2_BASE + 0x1C, 31); /* 4 bytes */
    qtest_writel(qts, SPI2_BASE + 0x34, GPSPI_INT_TRANS_DONE);
    qtest_writel(qts, SPI2_BASE + 0x38, GPSPI_INT_TRANS_DONE);
    qtest_writel(qts, SPI2_BASE + 0x00, GPSPI_CMD_USR_BIT);

    qtest_clock_step(qts, 600);
    g_assert_cmphex(qtest_readl(qts, SPI2_BASE + 0x3c) & GPSPI_INT_TRANS_DONE,
                    ==, 0);

    qtest_clock_step(qts, 1600);
    g_assert_cmphex(qtest_readl(qts, SPI2_BASE + 0x00) & GPSPI_CMD_USR_BIT, ==, 0);
    g_assert_cmphex(qtest_readl(qts, SPI2_BASE + 0x3c) & GPSPI_INT_TRANS_DONE,
                    ==, GPSPI_INT_TRANS_DONE);

    g_assert_cmphex(qtest_readl(qts, GDMA_BASE + in_dir_base + A_DMA_INT_RAW) &
                    (R_GDMA_INTERRUPT_IN_DONE_MASK | R_GDMA_INTERRUPT_IN_SUC_EOF_MASK),
                    ==, R_GDMA_INTERRUPT_IN_DONE_MASK | R_GDMA_INTERRUPT_IN_SUC_EOF_MASK);

    {
        uint8_t rx_after[4];

        qtest_memread(qts, rx_buf, rx_after, sizeof(rx_after));
        for (size_t i = 0; i < sizeof(rx_after); i++) {
            g_assert_cmphex(rx_after[i], ==, 0xff);
        }
    }

    qtest_writel(qts, SPI2_BASE + 0x38, GPSPI_INT_TRANS_DONE);

