skooch/espressif-qemu/tests/qtest/esp32s3-test.c
    qtest_quit(qts);
}

#ifndef _WIN32
static int connect_unix_socket(const char *path)
{
    struct sockaddr_un addr;
    int fd = socket(AF_UNIX, SOCK_STREAM, 0);

    g_assert_cmpint(fd, >=, 0);

    memset(&addr, 0, sizeof(addr));
    addr.sun_family = AF_UNIX;
    g_strlcpy(addr.sun_path, path, sizeof(addr.sun_path));

    for (int i = 0; i < 200; i++) {
        if (connect(fd, (struct sockaddr *)&addr, sizeof(addr)) == 0) {
            return fd;
        }
        g_usleep(1000);
    }

    g_error("failed to connect to %s", path);
}

static void test_usb_serial_jtag_rx_tx(void)
{
    g_autofree gchar *sock_dir = g_dir_make_tmp("esp32s3-jtag-XXXXXX", NULL);
    g_autofree gchar *sock_path = g_build_filename(sock_dir, "jtag.sock", NULL);
    QTestState *qts;
    int sock_fd;
    char tx_buf[3] = {0};
    char rx_byte = 'Z';
    char rx_block[76] = {0};
    int read_count = 0;

    qts = qtest_initf("-M esp32s3 "
                      "-serial null -serial null "
                      "-chardev socket,id=usj,path=%s,server=on,wait=off "
                      "-serial chardev:usj", sock_path);
    sock_fd = connect_unix_socket(sock_path);

    qtest_writel(qts, JTAG_BASE + USB_SERIAL_JTAG_INT_ENA_REG,
                 USB_SERIAL_JTAG_INT_RX_AVAIL | USB_SERIAL_JTAG_INT_TX_DONE);
    g_assert_cmphex(qtest_readl(qts, JTAG_BASE + USB_SERIAL_JTAG_EP1_CONF_REG) &
                    USB_SERIAL_JTAG_EP1_DATA_FREE, ==, USB_SERIAL_JTAG_EP1_DATA_FREE);
    qtest_writel(qts, JTAG_BASE + USB_SERIAL_JTAG_EP1_REG, 'O');
    qtest_writel(qts, JTAG_BASE + USB_SERIAL_JTAG_EP1_REG, 'K');
    g_assert_cmphex(qtest_readl(qts, JTAG_BASE + USB_SERIAL_JTAG_EP1_CONF_REG) &
                    USB_SERIAL_JTAG_EP1_DATA_FREE, ==, USB_SERIAL_JTAG_EP1_DATA_FREE);
    qtest_writel(qts, JTAG_BASE + USB_SERIAL_JTAG_EP1_CONF_REG, 0x1);

    g_assert_cmpint(read(sock_fd, tx_buf, 2), ==, 2);
    g_assert_cmpmem(tx_buf, 2, "OK", 2);
    g_assert_cmphex(qtest_readl(qts, JTAG_BASE + USB_SERIAL_JTAG_INT_RAW_REG) &
                    USB_SERIAL_JTAG_INT_TX_DONE,
                    ==, USB_SERIAL_JTAG_INT_TX_DONE);

    g_assert_cmpint(write(sock_fd, &rx_byte, 1), ==, 1);
    for (int i = 0; i < 50; i++) {
        qtest_clock_step(qts, 1000);
        if (qtest_readl(qts, JTAG_BASE + USB_SERIAL_JTAG_INT_RAW_REG) &
            USB_SERIAL_JTAG_INT_RX_AVAIL) {
            break;
        }
    }

    g_assert_cmphex(qtest_readl(qts, JTAG_BASE + USB_SERIAL_JTAG_INT_RAW_REG) &
                    USB_SERIAL_JTAG_INT_RX_AVAIL,
                    ==, USB_SERIAL_JTAG_INT_RX_AVAIL);
    g_assert_cmphex(qtest_readl(qts, JTAG_BASE + USB_SERIAL_JTAG_EP1_CONF_REG) &
                    USB_SERIAL_JTAG_EP1_DATA_AVAIL,
                    ==, USB_SERIAL_JTAG_EP1_DATA_AVAIL);
    g_assert_cmphex(qtest_readl(qts, JTAG_BASE + USB_SERIAL_JTAG_EP1_REG), ==, 'Z');
    for (size_t i = 0; i < 64; i++) {
        rx_block[i] = (char)('A' + (i % 26));
    }
    g_assert_cmpint(write(sock_fd, rx_block, 70), ==, 70);
    read_count = 0;
    for (int i = 0; i < 80; i++) {
        qtest_clock_step(qts, 1000);
        if (qtest_readl(qts, JTAG_BASE + USB_SERIAL_JTAG_EP1_REG) == 0) {
            break;
        }
        read_count++;
    }
    g_assert_cmpint(read_count, ==, 64);

    for (size_t i = 0; i < 64; i++) {
        qtest_writel(qts, JTAG_BASE + USB_SERIAL_JTAG_EP1_REG, (uint8_t)'T');
    }
    g_assert_cmphex(qtest_readl(qts, JTAG_BASE + USB_SERIAL_JTAG_EP1_CONF_REG) &
                    USB_SERIAL_JTAG_EP1_DATA_FREE, ==, 0);
    qtest_writel(qts, JTAG_BASE + USB_SERIAL_JTAG_EP1_REG, (uint8_t)'U');
    g_assert_cmphex(qtest_readl(qts, JTAG_BASE + USB_SERIAL_JTAG_EP1_CONF_REG) &
                    USB_SERIAL_JTAG_EP1_DATA_FREE, ==, USB_SERIAL_JTAG_EP1_DATA_FREE);

    g_assert_cmpint(write(sock_fd, rx_block, 70), ==, 70);
    g_assert_cmpint(write(sock_fd, rx_block, 70), ==, 70);

    qtest_writel(qts, JTAG_BASE + USB_SERIAL_JTAG_INT_CLR_REG,
                 USB_SERIAL_JTAG_INT_RX_AVAIL | USB_SERIAL_JTAG_INT_TX_DONE);
    g_assert_cmphex(qtest_readl(qts, JTAG_BASE + USB_SERIAL_JTAG_INT_RAW_REG), ==, 0);

    close(sock_fd);
    qtest_quit(qts);
}
#endif

static uint32_t i2c_cmd_write(size_t bytes, bool ack_check)
{
    uint32_t v = FIELD_DP32(0, I2C_CMD, BYTE_NUM, bytes);
    v = FIELD_DP32(v, I2C_CMD, OPCODE, I2C_OPCODE_WRITE);
    v = FIELD_DP32(v, I2C_CMD, ACK_CHECK_EN, ack_check ? 1 : 0);
    return v;
}

static uint32_t i2c_cmd_stop(void)
{
    return FIELD_DP32(0, I2C_CMD, OPCODE, I2C_OPCODE_STOP);
}

static uint32_t i2c_cmd_s3_read(size_t bytes, bool ack_check)
{
    uint32_t v = FIELD_DP32(0, I2C_CMD, BYTE_NUM, bytes);
    v = FIELD_DP32(v, I2C_CMD, OPCODE, I2C_OPCODE_READ);
    v = FIELD_DP32(v, I2C_CMD, ACK_CHECK_EN, ack_check ? 1 : 0);
    return v;
}

static uint32_t i2c_cmd_s3_stop(void)
{
    return FIELD_DP32(0, I2C_CMD, OPCODE, 2);
}

static uint32_t i2c_cmd_s3_end(void)
{
    return FIELD_DP32(0, I2C_CMD, OPCODE, I2C_OPCODE_END);
}

static void i2c_start_transaction(QTestState *qts)
{
    uint32_t ctr = FIELD_DP32(0, I2C_CTR, MS_MODE, 1);
    ctr = FIELD_DP32(ctr, I2C_CTR, TRANS_START, 1);
    qtest_writel(qts, I2C0_BASE + A_I2C_CTR, ctr);
    qtest_clock_step(qts, 3000);
}

static void test_i2c_read_path_and_deferred_complete(void)
{
    QTestState *qts = qts_start();
    const uint32_t expected_rx_len = 1;
    uint32_t ctr;

    qtest_writel(qts, I2C0_BASE + A_I2C_FIFO_DATA, 0x68); /* 0x34 write */
    qtest_writel(qts, I2C0_BASE + A_I2C_CMD,
                 i2c_cmd_write(1, true));
    qtest_writel(qts, I2C0_BASE + A_I2C_CMD + 4,
                 i2c_cmd_s3_read(expected_rx_len, false));
    qtest_writel(qts, I2C0_BASE + A_I2C_CMD + 8, i2c_cmd_s3_stop());
    qtest_writel(qts, I2C0_BASE + A_I2C_INT_ENA,
                 R_I2C_INT_ENA_TRANS_COMPLETE_MASK |
                 R_I2C_INT_ENA_END_DETECT_MASK);

    ctr = FIELD_DP32(0, I2C_CTR, MS_MODE, 1);
    ctr = FIELD_DP32(ctr, I2C_CTR, TRANS_START, 1);
    qtest_writel(qts, I2C0_BASE + A_I2C_CTR, ctr);
    qtest_clock_step(qts, 1000);
    g_assert_cmphex(qtest_readl(qts, I2C0_BASE + A_I2C_INT_RAW) &
                    (R_I2C_INT_RAW_TRANS_COMPLETE_MASK |
                     R_I2C_INT_RAW_END_DETECT_MASK), ==, 0);

