skooch/espressif-qemu/tests/qtest/esp32s3-test.c
    qtest_clock_step(qts, 1500);
    g_assert_cmphex(qtest_readl(qts, I2C0_BASE + A_I2C_INT_RAW) &
                    R_I2C_INT_RAW_TRANS_COMPLETE_MASK,
                    ==, R_I2C_INT_RAW_TRANS_COMPLETE_MASK);
    g_assert_cmphex(qtest_readl(qts, I2C0_BASE + A_I2C_INT_RAW) &
                    R_I2C_INT_RAW_END_DETECT_MASK, ==, 0);
    g_assert_cmpuint(FIELD_EX32(qtest_readl(qts, I2C0_BASE + A_I2C_STATUS),
                               I2C_STATUS, RXFIFO_CNT), ==, expected_rx_len);

    qtest_writel(qts, I2C0_BASE + A_I2C_CMD, i2c_cmd_s3_end());
    g_assert_cmphex(qtest_readl(qts, I2C0_BASE + A_I2C_INT_RAW) &
                    R_I2C_INT_RAW_END_DETECT_MASK, ==, 0);

    ctr = FIELD_DP32(0, I2C_CTR, MS_MODE, 1);
    ctr = FIELD_DP32(ctr, I2C_CTR, TRANS_START, 1);
    qtest_writel(qts, I2C0_BASE + A_I2C_CTR, ctr);
    qtest_clock_step(qts, 1000);
    g_assert_cmphex(qtest_readl(qts, I2C0_BASE + A_I2C_INT_RAW) &
                    R_I2C_INT_RAW_END_DETECT_MASK, ==, 0);
    qtest_clock_step(qts, 1500);
    g_assert_cmphex(qtest_readl(qts, I2C0_BASE + A_I2C_INT_RAW) &
                    R_I2C_INT_RAW_END_DETECT_MASK,
                    ==, R_I2C_INT_RAW_END_DETECT_MASK);

    qtest_writel(qts, I2C0_BASE + A_I2C_INT_CLR,
                 R_I2C_INT_CLR_TRANS_COMPLETE_MASK |
                 R_I2C_INT_CLR_END_DETECT_MASK |
                 R_I2C_INT_CLR_ACK_ERR_MASK);
    g_assert_cmphex(qtest_readl(qts, I2C0_BASE + A_I2C_INT_RAW), ==, 0);

    qtest_quit(qts);
}

static void test_i2c_done_and_ack_semantics(void)
{
    QTestState *qts = qts_start();

    qtest_writel(qts, I2C0_BASE + A_I2C_INT_ENA,
                 R_I2C_INT_ENA_ACK_ERR_MASK | R_I2C_INT_ENA_TRANS_COMPLETE_MASK);

    /* Successful write to a present device */
    qtest_writel(qts, I2C0_BASE + A_I2C_FIFO_DATA, 0x68); /* 0x34 write */
    qtest_writel(qts, I2C0_BASE + A_I2C_FIFO_DATA, 0x00);
    qtest_writel(qts, I2C0_BASE + A_I2C_CMD, i2c_cmd_write(2, true));
    qtest_writel(qts, I2C0_BASE + A_I2C_CMD + 4, i2c_cmd_stop());
    qtest_writel(qts, I2C0_BASE + A_I2C_CMD + 8, i2c_cmd_write(1, true));
    i2c_start_transaction(qts);

    g_assert_cmphex(qtest_readl(qts, I2C0_BASE + A_I2C_INT_RAW) &
                    R_I2C_INT_RAW_ACK_ERR_MASK, ==, 0);
    g_assert_cmphex(qtest_readl(qts, I2C0_BASE + A_I2C_INT_RAW) &
                    R_I2C_INT_RAW_TRANS_COMPLETE_MASK,
                    ==, R_I2C_INT_RAW_TRANS_COMPLETE_MASK);
    g_assert_cmphex(qtest_readl(qts, I2C0_BASE + A_I2C_CMD) &
                    R_I2C_CMD_DONE_MASK, ==, R_I2C_CMD_DONE_MASK);
    g_assert_cmphex(qtest_readl(qts, I2C0_BASE + A_I2C_CMD + 4) &
                    R_I2C_CMD_DONE_MASK, ==, R_I2C_CMD_DONE_MASK);
    g_assert_cmphex(qtest_readl(qts, I2C0_BASE + A_I2C_CMD + 8) &
                    R_I2C_CMD_DONE_MASK, ==, 0);

    qtest_writel(qts, I2C0_BASE + A_I2C_INT_CLR,
                 R_I2C_INT_CLR_TRANS_COMPLETE_MASK | R_I2C_INT_CLR_ACK_ERR_MASK);

    /* NACK on an unmapped address */
    qtest_writel(qts, I2C0_BASE + A_I2C_FIFO_DATA, 0xfe); /* 0x7f write */
    qtest_writel(qts, I2C0_BASE + A_I2C_CMD, i2c_cmd_write(1, true));
    qtest_writel(qts, I2C0_BASE + A_I2C_CMD + 4, i2c_cmd_stop());
    i2c_start_transaction(qts);

    g_assert_cmphex(qtest_readl(qts, I2C0_BASE + A_I2C_INT_RAW) &
                    R_I2C_INT_RAW_ACK_ERR_MASK,
                    ==, R_I2C_INT_RAW_ACK_ERR_MASK);
    g_assert_cmphex(qtest_readl(qts, I2C0_BASE + A_I2C_CMD) &
                    R_I2C_CMD_DONE_MASK, ==, R_I2C_CMD_DONE_MASK);
    g_assert_cmphex(qtest_readl(qts, I2C0_BASE + A_I2C_CMD + 4) &
                    R_I2C_CMD_DONE_MASK, ==, 0);

    qtest_quit(qts);
}

static void test_i2c_unsupported_modes(void)
{
    QTestState *qts = qts_start();
    uint32_t fifo_conf = FIELD_DP32(0, I2C_FIFO_CONF, NONFIFO_EN, 1);
    uint32_t ctr = FIELD_DP32(0, I2C_CTR, MS_MODE, 0);
    ctr = FIELD_DP32(ctr, I2C_CTR, TRANS_START, 1);

    qtest_writel(qts, I2C0_BASE + A_I2C_FIFO_CONF, fifo_conf);
    qtest_clock_step(qts, 1000);
    g_assert_cmphex(qtest_readl(qts, I2C0_BASE + A_I2C_FIFO_CONF) &
                    R_I2C_FIFO_CONF_NONFIFO_EN_MASK, ==, R_I2C_FIFO_CONF_NONFIFO_EN_MASK);
    g_assert_cmphex(qtest_readl(qts, I2C0_BASE + A_I2C_FIFO_CONF) &
                    (R_I2C_FIFO_CONF_RX_FIFO_RST_MASK |
                     R_I2C_FIFO_CONF_TX_FIFO_RST_MASK), ==, 0);

    qtest_writel(qts, I2C0_BASE + A_I2C_CTR, ctr);
    g_assert_cmphex(qtest_readl(qts, I2C0_BASE + A_I2C_CTR) &
                    R_I2C_CTR_MS_MODE_MASK, ==, 0);
    g_assert_cmphex(qtest_readl(qts, I2C0_BASE + A_I2C_CTR) &
                    R_I2C_CTR_TRANS_START_MASK, ==, 0);
    g_assert_cmphex(qtest_readl(qts, I2C0_BASE + A_I2C_INT_RAW), ==, 0);

    qtest_quit(qts);
}

static void test_uart_clock_dependent_timing(void)
{
    QTestState *qts = qts_start();
    uint32_t default_pulse = qtest_readl(qts, UART0_BASE + A_UART_LOWPULSE);
    uint32_t sysclk_xtal = 0;

    g_assert_cmpuint(default_pulse, >, 0);

    sysclk_xtal = FIELD_DP32(sysclk_xtal, SYSTEM_SYSCLK_CONF, PRE_DIV_CNT, 1);
    sysclk_xtal = FIELD_DP32(sysclk_xtal, SYSTEM_SYSCLK_CONF, CLK_XTAL_FREQ, 40);
    sysclk_xtal = FIELD_DP32(sysclk_xtal, SYSTEM_SYSCLK_CONF, SOC_CLK_SEL,
                             ESP32S3_CLK_SEL_XTAL);
    sysclk_xtal = FIELD_DP32(sysclk_xtal, SYSTEM_SYSCLK_CONF, CLK_DIV_EN, 1);
    qtest_writel(qts, SYSTEM_BASE + A_SYSTEM_SYSCLK_CONF, sysclk_xtal);

    g_assert_cmpuint(qtest_readl(qts, UART0_BASE + A_UART_LOWPULSE), <, default_pulse);

    qtest_writel(qts, UART0_BASE + A_UART_AUTOBAUD,
                 FIELD_DP32(0, UART_AUTOBAUD, EN, 1));
    g_assert_cmpuint(qtest_readl(qts, UART0_BASE + A_UART_RXD_CNT), ==, 400);

    qtest_quit(qts);
}

static void test_rtc_clk_update_propagates_to_system_and_uart(void)
{
    QTestState *qts = qts_start();
    uint32_t default_pulse = qtest_readl(qts, UART0_BASE + A_UART_LOWPULSE);
    uint32_t rtc_clk_conf = 0;
    uint32_t sysclk_conf;

    rtc_clk_conf = FIELD_DP32(rtc_clk_conf, RTC_CNTL_CLK_CONF, ANA_CLK_RTC_SEL,
                              ESP32_SLOW_CLK_RC);
    rtc_clk_conf = FIELD_DP32(rtc_clk_conf, RTC_CNTL_CLK_CONF, FAST_CLK_RTC_SEL,
                              ESP32_FAST_CLK_8M);
    rtc_clk_conf = FIELD_DP32(rtc_clk_conf, RTC_CNTL_CLK_CONF, SOC_CLK_SEL,
                              ESP32_SOC_CLK_XTAL);
    qtest_writel(qts, DR_REG_RTCCNTL_BASE + A_RTC_CNTL_CLK_CONF, rtc_clk_conf);

    sysclk_conf = qtest_readl(qts, SYSTEM_BASE + A_SYSTEM_SYSCLK_CONF);
    g_assert_cmpuint(FIELD_EX32(sysclk_conf, SYSTEM_SYSCLK_CONF, SOC_CLK_SEL),
                     ==, ESP32S3_CLK_SEL_XTAL);
    g_assert_cmpuint(qtest_readl(qts, UART0_BASE + A_UART_LOWPULSE), <, default_pulse);

    qtest_writel(qts, UART0_BASE + A_UART_AUTOBAUD,
                 FIELD_DP32(0, UART_AUTOBAUD, EN, 1));
    g_assert_cmpuint(qtest_readl(qts, UART0_BASE + A_UART_RXD_CNT), ==, 400);

