skooch/espressif-qemu/tests/qtest/esp32s3-test.c
    qtest_quit(qts);
}

static void test_system_clock_register_contract(void)
{
    QTestState *qts = qts_start();

    g_assert_cmphex(qtest_readl(qts, SYSTEM_BASE + A_SYSTEM_CLOCK_GATE) &
                    R_SYSTEM_CLOCK_GATE_CLK_EN_MASK,
                    ==, R_SYSTEM_CLOCK_GATE_CLK_EN_MASK);

    qtest_writel(qts, SYSTEM_BASE + A_SYSTEM_CPU_PER_CONF, 0xffffffff);
    g_assert_cmphex(qtest_readl(qts, SYSTEM_BASE + A_SYSTEM_CPU_PER_CONF),
                    ==, SYSTEM_CPU_PER_CONF_SUPPORTED_MASK);

    qtest_writel(qts, SYSTEM_BASE + A_SYSTEM_SYSCLK_CONF, 0xffffffff);
    g_assert_cmphex(qtest_readl(qts, SYSTEM_BASE + A_SYSTEM_SYSCLK_CONF) &
                    ~SYSTEM_SYSCLK_CONF_SUPPORTED_MASK,
                    ==, 0);

    qtest_writel(qts, SYSTEM_BASE + A_SYSTEM_PERIP_CLK_EN0, 0x13579bdf);
    qtest_writel(qts, SYSTEM_BASE + A_SYSTEM_PERIP_CLK_EN1, 0x2468ace0);
    qtest_writel(qts, SYSTEM_BASE + A_SYSTEM_PERIP_RST_EN0, 0x11223344);
    qtest_writel(qts, SYSTEM_BASE + A_SYSTEM_PERIP_RST_EN1, 0x55667788);
    g_assert_cmphex(qtest_readl(qts, SYSTEM_BASE + A_SYSTEM_PERIP_CLK_EN0),
                    ==, 0x13579bdf);
    g_assert_cmphex(qtest_readl(qts, SYSTEM_BASE + A_SYSTEM_PERIP_CLK_EN1),
                    ==, 0x2468ace0);
    g_assert_cmphex(qtest_readl(qts, SYSTEM_BASE + A_SYSTEM_PERIP_RST_EN0),
                    ==, 0x11223344);
    g_assert_cmphex(qtest_readl(qts, SYSTEM_BASE + A_SYSTEM_PERIP_RST_EN1),
                    ==, 0x55667788);

    qtest_writel(qts, SYSTEM_BASE + A_SYSTEM_CLOCK_GATE, 0xffffffff);
    g_assert_cmphex(qtest_readl(qts, SYSTEM_BASE + A_SYSTEM_CLOCK_GATE),
                    ==, R_SYSTEM_CLOCK_GATE_CLK_EN_MASK);

    qtest_quit(qts);
}

static void test_system_core1_runstall_transition(void)
{
    QTestState *qts = qts_start();

    qtest_irq_intercept_out_named(qts, "/machine/soc/clock",
                                  ESP32S3_CLOCK_CORE1_RUNSTALL_GPIO);

    g_assert_false(qtest_get_irq(qts, 0));

    qtest_writel(qts, SYSTEM_BASE + A_SYSTEM_CORE_1_CONTROL_0_REG, 1);
    g_assert_cmphex(qtest_readl(qts, SYSTEM_BASE + A_SYSTEM_CORE_1_CONTROL_0_REG),
                    ==, 1);
    g_assert_true(qtest_get_irq(qts, 0));

    qtest_writel(qts, SYSTEM_BASE + A_SYSTEM_CORE_1_CONTROL_0_REG, 0);
    g_assert_cmphex(qtest_readl(qts, SYSTEM_BASE + A_SYSTEM_CORE_1_CONTROL_0_REG),
                    ==, 0);
    g_assert_false(qtest_get_irq(qts, 0));

    qtest_quit(qts);
}

static void test_intmatrix_mapping_status_reserved(void)
{
    QTestState *qts = qts_start();

    g_assert_cmphex(qtest_readl(qts, INTMATRIX_MAP_REG(0, ESP32S3_GPIO_SOURCE)),
                    ==, 16);
    g_assert_cmphex(qtest_readl(qts, INTMATRIX_MAP_REG(1, ESP32S3_GPIO_SOURCE)),
                    ==, 16);

    qtest_writel(qts, INTMATRIX_MAP_REG(0, ESP32S3_GPIO_SOURCE), 19);
    qtest_writel(qts, INTMATRIX_MAP_REG(1, ESP32S3_GPIO_SOURCE), 20);
    g_assert_cmphex(qtest_readl(qts, INTMATRIX_MAP_REG(0, ESP32S3_GPIO_SOURCE)),
                    ==, 19);
    g_assert_cmphex(qtest_readl(qts, INTMATRIX_MAP_REG(1, ESP32S3_GPIO_SOURCE)),
                    ==, 20);

    qtest_set_irq_in(qts, "/machine/soc/intmatrix", NULL,
                     ESP32S3_GPIO_SOURCE, 1);
    g_assert_cmphex(qtest_readl(qts, INTMATRIX_STATUS_REG(0, 0)) &
                    BIT(ESP32S3_GPIO_SOURCE),
                    ==, BIT(ESP32S3_GPIO_SOURCE));
    g_assert_cmphex(qtest_readl(qts, INTMATRIX_STATUS_REG(1, 0)) &
                    BIT(ESP32S3_GPIO_SOURCE),
                    ==, BIT(ESP32S3_GPIO_SOURCE));

    qtest_set_irq_in(qts, "/machine/soc/intmatrix", NULL,
                     ESP32S3_GPIO_SOURCE, 0);
    g_assert_cmphex(qtest_readl(qts, INTMATRIX_STATUS_REG(0, 0)) &
                    BIT(ESP32S3_GPIO_SOURCE),
                    ==, 0);

    qtest_set_irq_in(qts, "/machine/soc/intmatrix", NULL, 15, 1);
    g_assert_cmphex(qtest_readl(qts, INTMATRIX_STATUS_REG(0, 0)) & BIT(15),
                    ==, 0);

    qtest_quit(qts);
}

static void test_rtc_explicit_register_surface(void)
{
    QTestState *qts = qts_start();

    g_assert_cmphex(qtest_readl(qts, RTC_CNTL_BASE + A_RTC_CNTL_DATE),
                    ==, ESP32S3_RTC_CNTL_DATE_RESET);

    qtest_writel(qts, RTC_CNTL_BASE + A_RTC_CNTL_SLP_TIMER0, 0x89abcdef);
    g_assert_cmphex(qtest_readl(qts, RTC_CNTL_BASE + A_RTC_CNTL_SLP_TIMER0),
                    ==, 0x89abcdef);

    qtest_writel(qts, RTC_CNTL_BASE + A_RTC_CNTL_SLP_TIMER1, UINT32_MAX);
    g_assert_cmphex(qtest_readl(qts, RTC_CNTL_BASE + A_RTC_CNTL_SLP_TIMER1),
                    ==, R_RTC_CNTL_SLP_TIMER1_SLP_VAL_HI_MASK);

    qtest_writel(qts, RTC_CNTL_BASE + A_RTC_CNTL_WAKEUP_STATE, UINT32_MAX);
    g_assert_cmphex(qtest_readl(qts, RTC_CNTL_BASE + A_RTC_CNTL_WAKEUP_STATE),
                    ==, R_RTC_CNTL_WAKEUP_STATE_WAKEUP_ENA_MASK);

    qtest_writel(qts, RTC_EXT_WAKEUP_CONF_REG, UINT32_MAX);
    g_assert_cmphex(qtest_readl(qts, RTC_EXT_WAKEUP_CONF_REG),
                    ==, R_RTC_CNTL_EXT_WAKEUP_CONF_EXT_WAKEUP1_LV_MASK |
                        R_RTC_CNTL_EXT_WAKEUP_CONF_EXT_WAKEUP0_LV_MASK |
                        R_RTC_CNTL_EXT_WAKEUP_CONF_GPIO_WAKEUP_FILTER_MASK);

    qtest_writel(qts, RTC_CNTL_BASE + A_RTC_CNTL_SLP_REJECT_CONF, UINT32_MAX);
    g_assert_cmphex(qtest_readl(qts, RTC_CNTL_BASE + A_RTC_CNTL_SLP_REJECT_CONF),
                    ==, R_RTC_CNTL_SLP_REJECT_CONF_DEEP_SLP_REJECT_EN_MASK |
                        R_RTC_CNTL_SLP_REJECT_CONF_LIGHT_SLP_REJECT_EN_MASK |
                        R_RTC_CNTL_SLP_REJECT_CONF_SLEEP_REJECT_ENA_MASK);

    qtest_writel(qts, RTC_CNTL_BASE + A_RTC_CNTL_WDTWPROTECT, 0x50d83aa1);
    g_assert_cmphex(qtest_readl(qts, RTC_CNTL_BASE + A_RTC_CNTL_WDTWPROTECT),
                    ==, 0x50d83aa1);

    qtest_writel(qts, RTC_CNTL_BASE + A_RTC_CNTL_SWD_CONF, UINT32_MAX);
    g_assert_cmphex(qtest_readl(qts, RTC_CNTL_BASE + A_RTC_CNTL_SWD_CONF),
                    ==, R_RTC_CNTL_SWD_CONF_SWD_AUTO_FEED_EN_MASK |
                        R_RTC_CNTL_SWD_CONF_SWD_DISABLE_MASK);

    qtest_writel(qts, RTC_CNTL_BASE + A_RTC_CNTL_SWD_WPROTECT, 0x8f1d312a);
    g_assert_cmphex(qtest_readl(qts, RTC_CNTL_BASE + A_RTC_CNTL_SWD_WPROTECT),
                    ==, 0x8f1d312a);

