skooch/espressif-qemu/tests/qtest/esp32s3-test.c
    qtest_writel(qts, RTC_CNTL_BASE + A_RTC_CNTL_PAD_HOLD, UINT32_MAX);
    g_assert_cmphex(qtest_readl(qts, RTC_CNTL_BASE + A_RTC_CNTL_PAD_HOLD),
                    ==, R_RTC_CNTL_PAD_HOLD_PAD_HOLD_MASK);

    qtest_writel(qts, RTC_CNTL_BASE + A_RTC_CNTL_DIG_PAD_HOLD, UINT32_MAX);
    g_assert_cmphex(qtest_readl(qts, RTC_CNTL_BASE + A_RTC_CNTL_DIG_PAD_HOLD),
                    ==, UINT32_MAX);

    qtest_writel(qts, RTC_EXT_WAKEUP1_REG, UINT32_MAX);
    g_assert_cmphex(qtest_readl(qts, RTC_EXT_WAKEUP1_REG),
                    ==, R_RTC_CNTL_EXT_WAKEUP1_EXT_WAKEUP1_SEL_MASK);

    qtest_writel(qts, RTC_CNTL_BASE + A_RTC_CNTL_DATE, UINT32_MAX);
    g_assert_cmphex(qtest_readl(qts, RTC_CNTL_BASE + A_RTC_CNTL_DATE),
                    ==, R_RTC_CNTL_DATE_DATE_MASK);

    qtest_writel(qts, RTC_RETENTION_CTRL_REG, UINT32_MAX);
    g_assert_cmphex(qtest_readl(qts, RTC_RETENTION_CTRL_REG), ==, 0);

    qtest_quit(qts);
}

static void test_rtc_timer_wakeup_transition(void)
{
    QTestState *qts = qts_start();
    const uint32_t alarm_ticks = 30;
    uint32_t timer1 = 0;
    uint32_t wakeup_state = 0;
    uint32_t state0 = 0;

    qtest_irq_intercept_out_named(qts, "/machine/soc/rtc_cntl",
                                  ESP32S3_RTC_LIGHT_SLEEP_GPIO);
    g_assert_false(qtest_get_irq(qts, 0));

    qtest_writel(qts, RTC_CNTL_BASE + A_RTC_CNTL_INT_CLR, UINT32_MAX);

    qtest_writel(qts, RTC_CNTL_BASE + A_RTC_CNTL_SLP_TIMER0, alarm_ticks);
    timer1 = FIELD_DP32(timer1, RTC_CNTL_SLP_TIMER1, MAIN_TIMER_ALARM_EN, 1);
    qtest_writel(qts, RTC_CNTL_BASE + A_RTC_CNTL_SLP_TIMER1, timer1);

    wakeup_state = FIELD_DP32(wakeup_state, RTC_CNTL_WAKEUP_STATE,
                              TIMER_WAKEUP_EN, 1);
    qtest_writel(qts, RTC_CNTL_BASE + A_RTC_CNTL_WAKEUP_STATE, wakeup_state);

    state0 = FIELD_DP32(state0, RTC_CNTL_STATE0, SLEEP_EN, 1);
    qtest_writel(qts, RTC_CNTL_BASE + A_RTC_CNTL_STATE0, state0);
    g_assert_cmphex(qtest_readl(qts, RTC_CNTL_BASE + A_RTC_CNTL_STATE0) &
                    R_RTC_CNTL_STATE0_SLEEP_EN_MASK,
                    ==, R_RTC_CNTL_STATE0_SLEEP_EN_MASK);
    g_assert_true(qtest_get_irq(qts, 0));

    g_assert_cmphex(qtest_readl(qts, RTC_CNTL_BASE + A_RTC_CNTL_INT_RAW) &
                    R_RTC_CNTL_INT_RAW_SLP_WAKEUP_MASK, ==, 0);

    qtest_clock_step(qts, 150000);
    g_assert_cmphex(qtest_readl(qts, RTC_CNTL_BASE + A_RTC_CNTL_INT_RAW) &
                    R_RTC_CNTL_INT_RAW_SLP_WAKEUP_MASK, ==, 0);

    qtest_clock_step(qts, 60000);
    g_assert_cmphex(qtest_readl(qts, RTC_CNTL_BASE + A_RTC_CNTL_INT_RAW) &
                    R_RTC_CNTL_INT_RAW_SLP_WAKEUP_MASK,
                    ==, R_RTC_CNTL_INT_RAW_SLP_WAKEUP_MASK);
    g_assert_cmphex(qtest_readl(qts, RTC_CNTL_BASE + A_RTC_CNTL_SLP_WAKEUP_CAUSE),
                    ==, R_RTC_CNTL_SLP_WAKEUP_CAUSE_TIMER_MASK);
    g_assert_cmphex(qtest_readl(qts, RTC_CNTL_BASE + A_RTC_CNTL_STATE0) &
                    R_RTC_CNTL_STATE0_SLP_WAKEUP_MASK,
                    ==, R_RTC_CNTL_STATE0_SLP_WAKEUP_MASK);
    g_assert_false(qtest_get_irq(qts, 0));

    qtest_writel(qts, RTC_CNTL_BASE + A_RTC_CNTL_INT_CLR,
                 R_RTC_CNTL_INT_RAW_SLP_WAKEUP_MASK);
    g_assert_cmphex(qtest_readl(qts, RTC_CNTL_BASE + A_RTC_CNTL_INT_RAW) &
                    R_RTC_CNTL_INT_RAW_SLP_WAKEUP_MASK, ==, 0);

    qtest_quit(qts);
}

static void test_rtc_gpio_low_wakeup_transition(void)
{
    QTestState *qts = qts_start();
    uint32_t pin_cfg = BIT(10) | (GPIO_INT_LOW << GPIO_PIN_INT_TYPE_SHIFT);
    uint32_t wakeup_state = 0;
    uint32_t state0 = 0;

    set_gpio_input_level(qts, 15, true);
    qtest_writel(qts, GPIO_BASE + GPIO_PIN_REG(15), pin_cfg);
    qtest_writel(qts, RTC_CNTL_BASE + A_RTC_CNTL_INT_CLR, UINT32_MAX);

    wakeup_state = FIELD_DP32(wakeup_state, RTC_CNTL_WAKEUP_STATE,
                              GPIO_WAKEUP_EN, 1);
    qtest_writel(qts, RTC_CNTL_BASE + A_RTC_CNTL_WAKEUP_STATE, wakeup_state);

    state0 = FIELD_DP32(state0, RTC_CNTL_STATE0, SLEEP_EN, 1);
    qtest_writel(qts, RTC_CNTL_BASE + A_RTC_CNTL_STATE0, state0);
    g_assert_cmphex(qtest_readl(qts, RTC_CNTL_BASE + A_RTC_CNTL_STATE0) &
                    R_RTC_CNTL_STATE0_SLEEP_EN_MASK,
                    ==, R_RTC_CNTL_STATE0_SLEEP_EN_MASK);

    g_assert_cmphex(qtest_readl(qts, RTC_CNTL_BASE + A_RTC_CNTL_INT_RAW) &
                    R_RTC_CNTL_INT_RAW_SLP_WAKEUP_MASK, ==, 0);

    set_gpio_input_level(qts, 15, false);

    g_assert_cmphex(qtest_readl(qts, RTC_CNTL_BASE + A_RTC_CNTL_INT_RAW) &
                    R_RTC_CNTL_INT_RAW_SLP_WAKEUP_MASK,
                    ==, R_RTC_CNTL_INT_RAW_SLP_WAKEUP_MASK);
    g_assert_cmphex(qtest_readl(qts, RTC_CNTL_BASE + A_RTC_CNTL_SLP_WAKEUP_CAUSE),
                    ==, R_RTC_CNTL_SLP_WAKEUP_CAUSE_GPIO_MASK);
    g_assert_cmphex(qtest_readl(qts, RTC_CNTL_BASE + A_RTC_CNTL_STATE0) &
                    R_RTC_CNTL_STATE0_SLP_WAKEUP_MASK,
                    ==, R_RTC_CNTL_STATE0_SLP_WAKEUP_MASK);

    qtest_quit(qts);
}

static void test_rtc_gpio_low_reject_transition(void)
{
    QTestState *qts = qts_start();
    uint32_t pin_cfg = BIT(10) | (GPIO_INT_LOW << GPIO_PIN_INT_TYPE_SHIFT);
    uint32_t wakeup_state = 0;
    uint32_t reject_conf = 0;
    uint32_t state0 = 0;

    qtest_irq_intercept_out_named(qts, "/machine/soc/rtc_cntl",
                                  ESP32S3_RTC_LIGHT_SLEEP_GPIO);
    g_assert_false(qtest_get_irq(qts, 0));

    set_gpio_input_level(qts, 15, false);
    qtest_writel(qts, GPIO_BASE + GPIO_PIN_REG(15), pin_cfg);
    qtest_writel(qts, RTC_CNTL_BASE + A_RTC_CNTL_INT_CLR, UINT32_MAX);

    wakeup_state = FIELD_DP32(wakeup_state, RTC_CNTL_WAKEUP_STATE,
                              GPIO_WAKEUP_EN, 1);
    qtest_writel(qts, RTC_CNTL_BASE + A_RTC_CNTL_WAKEUP_STATE, wakeup_state);

    reject_conf = FIELD_DP32(reject_conf, RTC_CNTL_SLP_REJECT_CONF,
                             LIGHT_SLP_REJECT_EN, 1);
    qtest_writel(qts, RTC_CNTL_BASE + A_RTC_CNTL_SLP_REJECT_CONF, reject_conf);

