skooch/espressif-qemu/tests/qtest/esp32s3-test.c
    qtest_quit(qts);
}

static void esp32s3_qmp_system_reset(QTestState *qts)
{
    qtest_qmp_assert_success(qts, "{ 'execute': 'system_reset' }");
    qtest_qmp_eventwait(qts, "RESET");
}

static void test_rtc_reset_transitions(void)
{
    QTestState *qts = qts_start();
    const uint32_t scratch_value = 0xfeed1234;
    const uint32_t uart_int_ena = R_UART_INT_ENA_RXFIFO_FULL_MASK |
                                  R_UART_INT_ENA_RXFIFO_TOUT_MASK;
    uint32_t options0 = 0;
    uint32_t reset_state;

    qtest_writel(qts, RTC_CNTL_BASE + A_RTC_CNTL_STORE0, scratch_value);
    qtest_writel(qts, UART0_BASE + A_UART_INT_ENA, uart_int_ena);

    options0 = FIELD_DP32(options0, RTC_CNTL_OPTIONS0, SW_PROCPU_RESET, 1);
    qtest_writel(qts, RTC_CNTL_BASE + A_RTC_CNTL_OPTIONS0, options0);

    reset_state = qtest_readl(qts, RTC_CNTL_BASE + A_RTC_CNTL_RESET_STATE);
    g_assert_cmpuint(FIELD_EX32(reset_state, RTC_CNTL_RESET_STATE,
                                RESET_CAUSE_PROCPU), ==, ESP32_SW_CPU_RESET);
    g_assert_cmpuint(FIELD_EX32(reset_state, RTC_CNTL_RESET_STATE,
                                RESET_CAUSE_APPCPU), ==, ESP32_POWERON_RESET);
    g_assert_cmphex(qtest_readl(qts, RTC_CNTL_BASE + A_RTC_CNTL_OPTIONS0) &
                    R_RTC_CNTL_OPTIONS0_SW_PROCPU_RESET_MASK, ==, 0);
    g_assert_cmphex(qtest_readl(qts, UART0_BASE + A_UART_INT_ENA),
                    ==, uart_int_ena);
    g_assert_cmphex(qtest_readl(qts, RTC_CNTL_BASE + A_RTC_CNTL_STORE0),
                    ==, scratch_value);

    options0 = FIELD_DP32(0, RTC_CNTL_OPTIONS0, SW_APPCPU_RESET, 1);
    qtest_writel(qts, RTC_CNTL_BASE + A_RTC_CNTL_OPTIONS0, options0);

    reset_state = qtest_readl(qts, RTC_CNTL_BASE + A_RTC_CNTL_RESET_STATE);
    g_assert_cmpuint(FIELD_EX32(reset_state, RTC_CNTL_RESET_STATE,
                                RESET_CAUSE_PROCPU), ==, ESP32_SW_CPU_RESET);
    g_assert_cmpuint(FIELD_EX32(reset_state, RTC_CNTL_RESET_STATE,
                                RESET_CAUSE_APPCPU), ==, ESP32_SW_CPU_RESET);
    g_assert_cmphex(qtest_readl(qts, RTC_CNTL_BASE + A_RTC_CNTL_OPTIONS0) &
                    R_RTC_CNTL_OPTIONS0_SW_APPCPU_RESET_MASK, ==, 0);
    g_assert_cmphex(qtest_readl(qts, UART0_BASE + A_UART_INT_ENA),
                    ==, uart_int_ena);
    g_assert_cmphex(qtest_readl(qts, RTC_CNTL_BASE + A_RTC_CNTL_STORE0),
                    ==, scratch_value);

    options0 = FIELD_DP32(0, RTC_CNTL_OPTIONS0, SW_SYS_RESET, 1);
    qtest_writel(qts, RTC_CNTL_BASE + A_RTC_CNTL_OPTIONS0, options0);

    reset_state = qtest_readl(qts, RTC_CNTL_BASE + A_RTC_CNTL_RESET_STATE);
    g_assert_cmpuint(FIELD_EX32(reset_state, RTC_CNTL_RESET_STATE,
                                RESET_CAUSE_PROCPU), ==, ESP32_SW_SYS_RESET);
    g_assert_cmpuint(FIELD_EX32(reset_state, RTC_CNTL_RESET_STATE,
                                RESET_CAUSE_APPCPU), ==, ESP32_SW_SYS_RESET);
    g_assert_cmphex(qtest_readl(qts, RTC_CNTL_BASE + A_RTC_CNTL_OPTIONS0) &
                    R_RTC_CNTL_OPTIONS0_SW_SYS_RESET_MASK, ==, 0);
    g_assert_cmphex(qtest_readl(qts, UART0_BASE + A_UART_INT_ENA), ==, 0);
    g_assert_cmphex(qtest_readl(qts, RTC_CNTL_BASE + A_RTC_CNTL_STORE0),
                    ==, scratch_value);

    qtest_writel(qts, UART0_BASE + A_UART_INT_ENA, uart_int_ena);
    esp32s3_qmp_system_reset(qts);
    g_assert_cmphex(qtest_readl(qts, UART0_BASE + A_UART_INT_ENA), ==, 0);

    qtest_quit(qts);
}

static void test_rtc_cpu_stall_transition(void)
{
    QTestState *qts = qts_start();
    uint32_t sw_cpu_stall = 0;
    uint32_t options0 = 0;

    qtest_irq_intercept_out_named(qts, "/machine/soc/rtc_cntl",
                                  ESP32S3_RTC_CPU_STALL_GPIO);

    g_assert_false(qtest_get_irq(qts, 0));
    g_assert_false(qtest_get_irq(qts, 1));

    sw_cpu_stall = FIELD_DP32(sw_cpu_stall, RTC_CNTL_SW_CPU_STALL,
                              APPCPU_C1, 0x21);
    qtest_writel(qts, RTC_CNTL_BASE + A_RTC_CNTL_SW_CPU_STALL, sw_cpu_stall);
    g_assert_false(qtest_get_irq(qts, 1));

    options0 = FIELD_DP32(options0, RTC_CNTL_OPTIONS0, SW_STALL_APPCPU_C0, 2);
    qtest_writel(qts, RTC_CNTL_BASE + A_RTC_CNTL_OPTIONS0, options0);
    g_assert_true(qtest_get_irq(qts, 1));

    qtest_writel(qts, RTC_CNTL_BASE + A_RTC_CNTL_OPTIONS0, 0);
    g_assert_false(qtest_get_irq(qts, 1));

    sw_cpu_stall = FIELD_DP32(0, RTC_CNTL_SW_CPU_STALL, PROCPU_C1, 0x21);
    qtest_writel(qts, RTC_CNTL_BASE + A_RTC_CNTL_SW_CPU_STALL, sw_cpu_stall);

    options0 = FIELD_DP32(0, RTC_CNTL_OPTIONS0, SW_STALL_PROCPU_C0, 2);
    qtest_writel(qts, RTC_CNTL_BASE + A_RTC_CNTL_OPTIONS0, options0);
    g_assert_true(qtest_get_irq(qts, 0));

    qtest_writel(qts, RTC_CNTL_BASE + A_RTC_CNTL_OPTIONS0, 0);
    g_assert_false(qtest_get_irq(qts, 0));

    qtest_quit(qts);
}

static uint64_t wait_for_uart_timeout_ns(QTestState *qts, uint64_t step_ns, uint64_t max_ns)
{
    uint64_t elapsed = 0;

    while (elapsed <= max_ns) {
        if (qtest_readl(qts, UART0_BASE + A_UART_INT_RAW) &
            R_UART_INT_RAW_RXFIFO_TOUT_MASK) {
            return elapsed;
        }
        qtest_clock_step(qts, step_ns);
        elapsed += step_ns;
    }

    return max_ns + 1;
}

static void test_uart_rx_timeout_multi_config(void)
{
    g_autofree gchar *sock_dir = g_dir_make_tmp("esp32s3-uart-XXXXXX", NULL);
    g_autofree gchar *sock_path = g_build_filename(sock_dir, "uart.sock", NULL);
    QTestState *qts;
    int sock_fd;
    uint64_t short_timeout;
    uint64_t long_threshold_timeout;
    uint64_t fast_baud_timeout;
    uint64_t slow_baud_timeout;
    char rx_byte = 'Z';

    qts = qtest_initf("-M esp32s3 "
                      "-chardev socket,id=uart0,path=%s,server=on,wait=off "
                      "-serial chardev:uart0", sock_path);
    sock_fd = connect_unix_socket(sock_path);

    qtest_writel(qts, UART0_BASE + A_UART_INT_ENA,
                 R_UART_INT_ENA_RXFIFO_TOUT_MASK);

    qtest_writel(qts, UART0_BASE + A_ESP32S3_UART_MEM_CONF,
                 FIELD_DP32(0, ESP32S3_UART_MEM_CONF, RX_TOUT_THRHD, 1));
    qtest_writel(qts, UART0_BASE + A_ESP32S3_UART_CONF1,
                 FIELD_DP32(0, ESP32S3_UART_CONF1, RX_TOUT_EN, 1));
    qtest_writel(qts, UART0_BASE + A_UART_INT_CLR, R_UART_INT_CLR_RXFIFO_TOUT_MASK);
    g_assert_cmpint(write(sock_fd, &rx_byte, 1), ==, 1);
    qtest_clock_step(qts, 1000);
    short_timeout = wait_for_uart_timeout_ns(qts, 100, 5000000);
    g_assert_cmpuint(short_timeout, <=, 5000000);

    qtest_writel(qts, UART0_BASE + A_ESP32S3_UART_MEM_CONF,
                 FIELD_DP32(0, ESP32S3_UART_MEM_CONF, RX_TOUT_THRHD, 4));
    qtest_writel(qts, UART0_BASE + A_ESP32S3_UART_CONF1,
                 FIELD_DP32(0, ESP32S3_UART_CONF1, RX_TOUT_EN, 1));
    qtest_writel(qts, UART0_BASE + A_UART_INT_CLR, R_UART_INT_CLR_RXFIFO_TOUT_MASK);
    g_assert_cmpint(write(sock_fd, &rx_byte, 1), ==, 1);
    qtest_clock_step(qts, 1000);
    long_threshold_timeout = wait_for_uart_timeout_ns(qts, 100, 5000000);
    g_assert_cmpuint(long_threshold_timeout, >, short_timeout);

    qtest_writel(qts, UART0_BASE + A_ESP32S3_UART_MEM_CONF,
                 FIELD_DP32(0, ESP32S3_UART_MEM_CONF, RX_TOUT_THRHD, 1));
    qtest_writel(qts, UART0_BASE + A_ESP32S3_UART_CONF1,
                 FIELD_DP32(0, ESP32S3_UART_CONF1, RX_TOUT_EN, 1));
    qtest_writel(qts, UART0_BASE + A_UART_INT_CLR, R_UART_INT_CLR_RXFIFO_TOUT_MASK);
    qtest_writel(qts, UART0_BASE + A_UART_CLKDIV,
                 FIELD_DP32(0, UART_CLKDIV, CLKDIV, 0x400));
    g_assert_cmpint(write(sock_fd, &rx_byte, 1), ==, 1);
    qtest_clock_step(qts, 1000);
    fast_baud_timeout = wait_for_uart_timeout_ns(qts, 100, 5000000);

    qtest_writel(qts, UART0_BASE + A_ESP32S3_UART_MEM_CONF,
                 FIELD_DP32(0, ESP32S3_UART_MEM_CONF, RX_TOUT_THRHD, 1));
    qtest_writel(qts, UART0_BASE + A_ESP32S3_UART_CONF1,
                 FIELD_DP32(0, ESP32S3_UART_CONF1, RX_TOUT_EN, 1));
    qtest_writel(qts, UART0_BASE + A_UART_INT_CLR, R_UART_INT_CLR_RXFIFO_TOUT_MASK);
    qtest_writel(qts, UART0_BASE + A_UART_CLKDIV,
                 FIELD_DP32(0, UART_CLKDIV, CLKDIV, 0x800));
    g_assert_cmpint(write(sock_fd, &rx_byte, 1), ==, 1);
    qtest_clock_step(qts, 1000);
    slow_baud_timeout = wait_for_uart_timeout_ns(qts, 100, 5000000);

    g_assert_cmpuint(slow_baud_timeout, >, fast_baud_timeout);

    qtest_writel(qts, UART0_BASE + A_ESP32S3_UART_CONF1, 0);
    qtest_writel(qts, UART0_BASE + A_UART_INT_CLR, R_UART_INT_CLR_RXFIFO_TOUT_MASK);
    qtest_clock_step(qts, 20000);
    g_assert_cmphex(qtest_readl(qts, UART0_BASE + A_UART_INT_RAW) &
                    R_UART_INT_RAW_RXFIFO_TOUT_MASK, ==, 0);

