skooch/espressif-qemu/tests/qtest/esp32s3-test.c
    close(sock_fd);
    qtest_quit(qts);
}

static void test_sha_irq(void)
{
    QTestState *qts = qts_start();

    qtest_writel(qts, SHA_BASE + A_SHA_IRQ_ENA,
                 FIELD_DP32(0, SHA_IRQ_ENA, INTERRUPT_ENA, 1));
    qtest_writel(qts, SHA_BASE + A_SHA_MODE, ESP_SHA_256_MODE);
    qtest_writel(qts, SHA_BASE + A_SHA_M_MEM, 0x61626380);
    qtest_writel(qts, SHA_BASE + A_SHA_START,
                 FIELD_DP32(0, SHA_START, START, 1));

    g_assert_cmphex(qtest_readl(qts, SHA_BASE + A_SHA_BUSY), ==, 0);
    g_assert_cmphex(qtest_readl(qts, SHA_BASE + A_SHA_H_MEM), !=, 0);

    qtest_writel(qts, SHA_BASE + A_SHA_CLEAR_IRQ,
                 FIELD_DP32(0, SHA_CLEAR_IRQ, CLEAR_INTERRUPT, 1));
    g_assert_cmphex(qtest_readl(qts, SHA_BASE + A_SHA_IRQ_ENA), ==, 1);

    qtest_quit(qts);
}

static void test_sha_dma_start_and_continue_irq_paths(void)
{
    QTestState *qts = qts_start();
    const uint32_t block_len = 64;
    const uint8_t block0[64] = { 0 };
    const uint8_t block1[64] = { 0xbb };
    const uint32_t sha_desc = SHA_DMA_DESC_BASE;
    uint32_t hash_start;
    uint32_t hash_continue;

    qtest_memwrite(qts, sha_dma_buf_addr(block_len), block0, block_len);
    write_gdma_descriptor(qts, sha_desc, block_len, block_len, true, false,
                          sha_dma_buf_addr(block_len), 0);
    g_assert_cmpuint(qtest_readl(qts, sha_desc + 0) & 0xfff, ==, block_len);
    g_assert_cmpuint((qtest_readl(qts, sha_desc + 0) >> 12) & 0xfff, ==, block_len);
    g_assert_cmphex(qtest_readl(qts, sha_desc + 4), ==,
                    sha_dma_buf_addr(block_len));
    qtest_writel(qts, GDMA_BASE + GDMA_SPI2_CHAN * DMA_CHAN_REGS_SIZE +
                 ESP_GDMA_OUT_IDX * DMA_DIR_REGS_SIZE + A_DMA_PERI_SEL,
                 FIELD_DP32(0, GDMA_PERI_SEL, PERI_SEL, GDMA_SHA));
    qtest_writel(qts, GDMA_BASE + GDMA_SPI2_CHAN * DMA_CHAN_REGS_SIZE +
                 ESP_GDMA_OUT_IDX * DMA_DIR_REGS_SIZE + A_DMA_LINK,
                 R_GDMA_OUT_LINK_START_MASK | (sha_desc & R_GDMA_OUT_LINK_ADDR_MASK));
    g_assert_cmphex(qtest_readl(qts, GDMA_BASE + GDMA_SPI2_CHAN * DMA_CHAN_REGS_SIZE +
                    ESP_GDMA_OUT_IDX * DMA_DIR_REGS_SIZE + A_DMA_PERI_SEL),
                    ==, FIELD_DP32(0, GDMA_PERI_SEL, PERI_SEL, GDMA_SHA));
    g_assert_cmphex(qtest_readl(qts, GDMA_BASE + GDMA_SPI2_CHAN * DMA_CHAN_REGS_SIZE +
                    ESP_GDMA_OUT_IDX * DMA_DIR_REGS_SIZE + A_DMA_LINK) &
                    R_GDMA_OUT_LINK_START_MASK,
                    ==, R_GDMA_OUT_LINK_START_MASK);

    qtest_writel(qts, SHA_BASE + A_SHA_MODE, ESP_SHA_256_MODE);
    qtest_writel(qts, SHA_BASE + A_SHA_DMA_BLOCK_NUM, 1);
    qtest_writel(qts, SHA_BASE + A_SHA_IRQ_ENA,
                 FIELD_DP32(0, SHA_IRQ_ENA, INTERRUPT_ENA, 1));
    qtest_writel(qts, SHA_BASE + A_SHA_DMA_START,
                 FIELD_DP32(0, SHA_DMA_START, DMA_START, 1));

    hash_start = qtest_readl(qts, SHA_BASE + A_SHA_H_MEM);
    g_assert_cmpuint(hash_start, !=, 0);

    qtest_writel(qts, SHA_BASE + A_SHA_CLEAR_IRQ,
                 FIELD_DP32(0, SHA_CLEAR_IRQ, CLEAR_INTERRUPT, 1));

    qtest_memwrite(qts, sha_dma_buf_addr(block_len), block1, block_len);
    write_gdma_descriptor(qts, sha_desc, block_len, block_len, true, false,
                          sha_dma_buf_addr(block_len), 0);
    qtest_writel(qts, SHA_BASE + A_SHA_DMA_CONTINUE,
                 FIELD_DP32(0, SHA_DMA_CONTINUE, DMA_CONTINUE, 1));

    hash_continue = qtest_readl(qts, SHA_BASE + A_SHA_H_MEM);
    g_assert_cmpuint(hash_continue, !=, hash_start);

    qtest_writel(qts, SHA_BASE + A_SHA_CLEAR_IRQ,
                 FIELD_DP32(0, SHA_CLEAR_IRQ, CLEAR_INTERRUPT, 1));

    qtest_quit(qts);
}

static void test_rng_modeled_surface(void)
{
    QTestState *qts = qts_start();
    uint32_t first = qtest_readl(qts, ESP32S3_RNG_BASE);
    bool changed = false;

    for (int i = 0; i < 8; i++) {
        changed |= qtest_readl(qts, ESP32S3_RNG_BASE) != first;
    }

    g_assert_true(changed);
    g_assert_cmphex(qtest_readl(qts, ESP32S3_RNG_BASE + 4), ==, 0);
    qtest_writel(qts, ESP32S3_RNG_BASE, 0xffffffff);
    g_assert_cmphex(qtest_readl(qts, ESP32S3_RNG_BASE + 4), ==, 0);
    qtest_qmp_assert_success(qts, "{ 'execute': 'system_reset' }");
    qtest_qmp_eventwait(qts, "RESET");
    g_assert_cmphex(qtest_readl(qts, ESP32S3_RNG_BASE + 4), ==, 0);

    qtest_quit(qts);
}

static void test_pms_modeled_surface(void)
{
    QTestState *qts = qts_start();
    const uint32_t test_data = 0x12345678;

    g_assert_cmphex(qtest_readl(qts, PMS_BASE + 0x04), ==, 0xff);
    g_assert_cmphex(qtest_readl(qts, PMS_BASE + 0x0c), ==, 1);
    g_assert_cmphex(qtest_readl(qts, PMS_BASE + 0x14), ==, 0x7ff);
    g_assert_cmphex(qtest_readl(qts, PMS_BASE + 0x2c), ==, 0xf);
    g_assert_cmphex(qtest_readl(qts, PMS_BASE + 0x34), ==, 0x3);
    g_assert_cmphex(qtest_readl(qts, PMS_BASE + 0x44), ==, 0xfff);
    qtest_writel(qts, PMS_BASE + 0x44, test_data);
    g_assert_cmphex(qtest_readl(qts, PMS_BASE + 0x44), ==,
                    test_data & 0xfff);
    g_assert_cmphex(qtest_readl(qts, PMS_BASE + 0x200), ==, 0);
    qtest_writel(qts, PMS_BASE + 0x200, test_data);
    g_assert_cmphex(qtest_readl(qts, PMS_BASE + 0x200), ==, 0);
    g_assert_cmphex(qtest_readl(qts, PMS_BASE + 0x308), ==, 1);
    qtest_writel(qts, PMS_BASE + 0x308, 0xffffffff);
    g_assert_cmphex(qtest_readl(qts, PMS_BASE + 0x308), ==, 1);
    g_assert_cmphex(qtest_readl(qts, PMS_BASE + 0xffc), ==, PMS_DATE_VALUE);
    qtest_writel(qts, PMS_BASE + 0xffc, 0xffffffff);
    g_assert_cmphex(qtest_readl(qts, PMS_BASE + 0xffc), ==, 0x0fffffff);

    qtest_quit(qts);
}

static hwaddr efuse_block_word_addr(unsigned block, unsigned word)
{
    unsigned word_offset;
    unsigned max_words;

    g_assert_cmpuint(block, <=, 10);
    max_words = block < 2 ? ESP_EFUSE_BLOCK0_WORDS : 8;
    g_assert_cmpuint(word, <, max_words);

    if (block == 0) {
        word_offset = 0;
    } else if (block == 1) {
        word_offset = ESP_EFUSE_BLOCK0_WORDS;
    } else {
        word_offset = ESP_EFUSE_BLOCK0_WORDS + ESP_EFUSE_BLOCK1_WORDS +
                      (block - 2) * 8;
    }

    return EFUSE_BASE + A_EFUSE_RD_WR_DIS_REG + (word_offset + word) * 4;
}

static void efuse_clear_ints(QTestState *qts)
{
    qtest_writel(qts, EFUSE_BASE + A_EFUSE_INT_CLR,
                 EFUSE_READ_DONE | EFUSE_PGM_DONE);
    g_assert_cmphex(qtest_readl(qts, EFUSE_BASE + A_EFUSE_INT_RAW), ==, 0);
}

static void efuse_reload_blocks(QTestState *qts)
{
    qtest_writel(qts, EFUSE_BASE + A_EFUSE_CONF, EFUSE_READ_OPCODE);
    qtest_writel(qts, EFUSE_BASE + A_EFUSE_CMD, BIT(0));
    qtest_clock_step(qts, EFUSE_OP_DELAY_NS);

    g_assert_cmphex(qtest_readl(qts, EFUSE_BASE + A_EFUSE_CMD), ==, 0);
    g_assert_cmphex(qtest_readl(qts, EFUSE_BASE + A_EFUSE_INT_RAW) &
                    EFUSE_READ_DONE, ==, EFUSE_READ_DONE);
    efuse_clear_ints(qts);
}

static void efuse_program_block(QTestState *qts, unsigned block,
                                const uint32_t words[ESP_EFUSE_PGM_DATA_COUNT],
                                bool expect_done)
{
    for (int i = 0; i < ESP_EFUSE_PGM_DATA_COUNT; i++) {
        qtest_writel(qts, EFUSE_BASE + A_EFUSE_PGM_DATA0_REG + i * 4,
                     words[i]);
    }

    qtest_writel(qts, EFUSE_BASE + A_EFUSE_CONF, EFUSE_WRITE_OPCODE);
    qtest_writel(qts, EFUSE_BASE + A_EFUSE_CMD, (block << 2) | BIT(1));
    qtest_clock_step(qts, EFUSE_OP_DELAY_NS);

    g_assert_cmphex(qtest_readl(qts, EFUSE_BASE + A_EFUSE_CMD), ==, 0);
    if (expect_done) {
        g_assert_cmphex(qtest_readl(qts, EFUSE_BASE + A_EFUSE_INT_RAW) &
                        EFUSE_PGM_DONE, ==, EFUSE_PGM_DONE);
        efuse_clear_ints(qts);
        efuse_reload_blocks(qts);
    } else {
        g_assert_cmphex(qtest_readl(qts, EFUSE_BASE + A_EFUSE_INT_RAW) &
                        EFUSE_PGM_DONE, ==, 0);
    }
}

