skooch/espressif-qemu/tests/qtest/esp32s3-test.c
static void test_efuse_explicit_contract(void)
{
    QTestState *qts = qts_start();
    const uint32_t block3_first[ESP_EFUSE_PGM_DATA_COUNT] = {
        0x0000ffff, 0x13572468, 0, 0, 0, 0, 0, 0,
    };
    const uint32_t block3_second[ESP_EFUSE_PGM_DATA_COUNT] = {
        0x00ff0000, 0, 0, 0, 0, 0, 0, 0,
    };
    const uint32_t block3_protected[ESP_EFUSE_PGM_DATA_COUNT] = {
        0xff000000, 0xffffffff, 0, 0, 0, 0, 0, 0,
    };
    const uint32_t protect_usr_data[ESP_EFUSE_PGM_DATA_COUNT] = {
        BIT(22), 0, 0, 0, 0, 0, 0, 0,
    };
    const uint32_t protect_key0_read[ESP_EFUSE_PGM_DATA_COUNT] = {
        0, BIT(0), 0, 0, 0, 0, 0, 0,
    };
    const uint32_t block4_key[ESP_EFUSE_PGM_DATA_COUNT] = {
        0x11112222, 0x33334444, 0, 0, 0, 0, 0, 0,
    };

    g_assert_cmphex(qtest_readl(qts, EFUSE_BASE + A_EFUSE_CLK), ==,
                    ESP32S3_EFUSE_CLK_RESET);
    g_assert_cmphex(qtest_readl(qts, EFUSE_BASE + A_EFUSE_DAC_CONF), ==,
                    ESP32S3_EFUSE_DAC_CONF_RESET);
    g_assert_cmphex(qtest_readl(qts, EFUSE_BASE + A_EFUSE_RD_TIM_CONF), ==,
                    ESP32S3_EFUSE_RD_TIM_RESET);
    g_assert_cmphex(qtest_readl(qts, EFUSE_BASE + A_EFUSE_WR_TIM_CONF1), ==,
                    ESP32S3_EFUSE_WR_TIM1_RESET);
    g_assert_cmphex(qtest_readl(qts, EFUSE_BASE + A_EFUSE_WR_TIM_CONF2), ==,
                    ESP32S3_EFUSE_WR_TIM2_RESET);
    g_assert_cmphex(qtest_readl(qts, EFUSE_BASE + A_EFUSE_DATE), ==,
                    ESP32S3_EFUSE_DATE_RESET);

    qtest_writel(qts, EFUSE_BASE + A_EFUSE_CLK, 0xffffffff);
    g_assert_cmphex(qtest_readl(qts, EFUSE_BASE + A_EFUSE_CLK), ==,
                    ESP32S3_EFUSE_CLK_WR_MASK);
    qtest_writel(qts, EFUSE_BASE + A_EFUSE_DATE, 0xffffffff);
    g_assert_cmphex(qtest_readl(qts, EFUSE_BASE + A_EFUSE_DATE), ==,
                    ESP32S3_EFUSE_DATE_WR_MASK);

    efuse_program_block(qts, 3, block3_first, true);
    g_assert_cmphex(qtest_readl(qts, efuse_block_word_addr(3, 0)), ==,
                    0x0000ffff);
    g_assert_cmphex(qtest_readl(qts, efuse_block_word_addr(3, 1)), ==,
                    0x13572468);

    efuse_program_block(qts, 3, block3_second, true);
    g_assert_cmphex(qtest_readl(qts, efuse_block_word_addr(3, 0)), ==,
                    0x00ffffff);

    efuse_program_block(qts, 0, protect_usr_data, true);
    g_assert_cmphex(qtest_readl(qts, efuse_block_word_addr(0, 0)) & BIT(22),
                    ==, BIT(22));
    efuse_program_block(qts, 3, block3_protected, false);
    g_assert_cmphex(qtest_readl(qts, efuse_block_word_addr(3, 0)), ==,
                    0x00ffffff);
    g_assert_cmphex(qtest_readl(qts, efuse_block_word_addr(3, 1)), ==,
                    0x13572468);

    efuse_program_block(qts, 4, block4_key, true);
    g_assert_cmphex(qtest_readl(qts, efuse_block_word_addr(4, 0)), ==,
                    0x11112222);
    efuse_program_block(qts, 0, protect_key0_read, true);
    efuse_reload_blocks(qts);
    g_assert_cmphex(qtest_readl(qts, efuse_block_word_addr(4, 0)), ==, 0);

    qtest_qmp_assert_success(qts, "{ 'execute': 'system_reset' }");
    qtest_qmp_eventwait(qts, "RESET");
    g_assert_cmphex(qtest_readl(qts, EFUSE_BASE + A_EFUSE_CLK), ==,
                    ESP32S3_EFUSE_CLK_RESET);
    g_assert_cmphex(qtest_readl(qts, EFUSE_BASE + A_EFUSE_DATE), ==,
                    ESP32S3_EFUSE_DATE_RESET);
    g_assert_cmphex(qtest_readl(qts, EFUSE_BASE + A_EFUSE_PGM_DATA0_REG), ==,
                    0);
    g_assert_cmphex(qtest_readl(qts, efuse_block_word_addr(3, 0)), ==,
                    0x00ffffff);
    g_assert_cmphex(qtest_readl(qts, efuse_block_word_addr(4, 0)), ==, 0);

    qtest_quit(qts);
}

static uint16_t openeth_mii_read(QTestState *qts, uint8_t reg)
{
    uint32_t cmd = qtest_readl(qts, OPENETH_MIICOMMAND_REG);

    qtest_writel(qts, OPENETH_MIIADDRESS_REG,
                 (reg << OPENETH_MIIADDRESS_RGAD_SHIFT) |
                 (OPENETH_DEFAULT_PHY << OPENETH_MIIADDRESS_FIAD_SHIFT));
    qtest_writel(qts, OPENETH_MIICOMMAND_REG, cmd | OPENETH_MIICOMMAND_RSTAT);

    return qtest_readl(qts, OPENETH_MIIRX_DATA_REG) & 0xffff;
}

static void openeth_read_mac(QTestState *qts, uint8_t mac[6])
{
    uint32_t mac0 = qtest_readl(qts, OPENETH_MAC_ADDR0_REG);
    uint32_t mac1 = qtest_readl(qts, OPENETH_MAC_ADDR1_REG);

    mac[0] = (mac1 >> 8) & 0xff;
    mac[1] = mac1 & 0xff;
    mac[2] = (mac0 >> 24) & 0xff;
    mac[3] = (mac0 >> 16) & 0xff;
    mac[4] = (mac0 >> 8) & 0xff;
    mac[5] = mac0 & 0xff;
}

static void openeth_wait_for_link_state(QTestState *qts, bool up)
{
    uint32_t expected_linkfail = up ? 0 : OPENETH_MIISTATUS_LINKFAIL;

    for (int i = 0; i < 100; i++) {
        uint16_t bmsr = openeth_mii_read(qts, MII_BMSR);
        uint32_t miistatus = qtest_readl(qts, OPENETH_MIISTATUS_REG) &
                             OPENETH_MIISTATUS_LINKFAIL;

        if (!!(bmsr & MII_BMSR_LINK_ST) == up &&
            miistatus == expected_linkfail) {
            return;
        }

        qtest_clock_step(qts, 1);
    }

    g_assert_not_reached();
}

static void test_emac_link_and_loopback_surface(void)
{
    QTestState *qts = qts_start_with_openeth();
    uint8_t mac[6];
    uint8_t tx_frame[64] = { 0 };
    uint8_t rx_frame[sizeof(tx_frame) + 4];
    uint32_t tx_len_flags;
    uint32_t rx_len_flags;

    qtest_irq_intercept_in(qts, "/machine/soc/intmatrix");

    g_assert_cmphex(qtest_readl(qts, EMAC_BASE + 0x00), ==, OPENETH_MODER_DEFAULT);

    qtest_writel(qts, OPENETH_MIICOMMAND_REG, OPENETH_MIICOMMAND_SCANSTAT);
    g_assert_cmphex(qtest_readl(qts, OPENETH_MIICOMMAND_REG) &
                    OPENETH_MIICOMMAND_SCANSTAT,
                    ==, OPENETH_MIICOMMAND_SCANSTAT);
    g_assert_cmphex(openeth_mii_read(qts, MII_BMSR) & MII_BMSR_LINK_ST,
                    ==, MII_BMSR_LINK_ST);
    g_assert_cmphex(qtest_readl(qts, OPENETH_MIISTATUS_REG) &
                    OPENETH_MIISTATUS_LINKFAIL,
                    ==, 0);

    qtest_qmp_assert_success(qts,
                             "{ 'execute': 'set_link', 'arguments': { "
                             "'name': 'emac0', 'up': false } }");
    openeth_wait_for_link_state(qts, false);

