skooch/espressif-qemu/tests/qtest/esp32s3-test.c
    qtest_qmp_assert_success(qts,
                             "{ 'execute': 'set_link', 'arguments': { "
                             "'name': 'emac0', 'up': true } }");
    openeth_wait_for_link_state(qts, true);

    openeth_read_mac(qts, mac);
    memcpy(tx_frame, mac, sizeof(mac));
    tx_frame[6] = 0x02;
    tx_frame[7] = 0x00;
    tx_frame[8] = 0x00;
    tx_frame[9] = 0x00;
    tx_frame[10] = 0x00;
    tx_frame[11] = 0x01;
    tx_frame[12] = 0x08;
    tx_frame[13] = 0x00;
    for (size_t i = 14; i < sizeof(tx_frame); i++) {
        tx_frame[i] = i;
    }

    qtest_memwrite(qts, OPENETH_TX_BUF_BASE, tx_frame, sizeof(tx_frame));
    qtest_memset(qts, OPENETH_RX_BUF_BASE, 0xcc, sizeof(rx_frame));

    qtest_writel(qts, OPENETH_INT_SOURCE_REG, 0xffffffff);
    qtest_writel(qts, OPENETH_INT_MASK_REG,
                 OPENETH_INT_SOURCE_RXB | OPENETH_INT_SOURCE_TXB);

    qtest_writel(qts, OPENETH_RX_DESC0_ADDR + 4, OPENETH_RX_BUF_BASE);
    qtest_writel(qts, OPENETH_RX_DESC0_ADDR + 0,
                 OPENETH_RXD_E | OPENETH_RXD_IRQ);

    qtest_writel(qts, EMAC_BASE + 0x00,
                 OPENETH_MODER_DEFAULT |
                 OPENETH_MODER_LOOPBCK |
                 OPENETH_MODER_PRO |
                 OPENETH_MODER_TXEN |
                 OPENETH_MODER_RXEN);

    qtest_writel(qts, OPENETH_TX_DESC0_ADDR + 4, OPENETH_TX_BUF_BASE);
    qtest_writel(qts, OPENETH_TX_DESC0_ADDR + 0,
                 (sizeof(tx_frame) << 16) |
                 OPENETH_TXD_IRQ |
                 OPENETH_TXD_RD);

    g_assert_true(qtest_get_irq(qts, ESP32S3_EMAC_SOURCE));
    g_assert_cmphex(qtest_readl(qts, OPENETH_INT_SOURCE_REG) &
                    (OPENETH_INT_SOURCE_RXB | OPENETH_INT_SOURCE_TXB),
                    ==, OPENETH_INT_SOURCE_RXB | OPENETH_INT_SOURCE_TXB);

    tx_len_flags = qtest_readl(qts, OPENETH_TX_DESC0_ADDR + 0);
    g_assert_cmphex(tx_len_flags & OPENETH_TXD_RD, ==, 0);

    rx_len_flags = qtest_readl(qts, OPENETH_RX_DESC0_ADDR + 0);
    g_assert_cmphex(rx_len_flags & OPENETH_RXD_E, ==, 0);
    g_assert_cmphex(rx_len_flags & OPENETH_RXD_M, ==, 0);
    g_assert_cmpuint(rx_len_flags >> 16, ==, sizeof(tx_frame) + 4);

    qtest_memread(qts, OPENETH_RX_BUF_BASE, rx_frame, sizeof(rx_frame));
    g_assert_cmpmem(rx_frame, sizeof(tx_frame), tx_frame, sizeof(tx_frame));
    g_assert_cmphex(ldl_le_p(&rx_frame[sizeof(tx_frame)]), ==, 0);

    qtest_writel(qts, OPENETH_INT_SOURCE_REG,
                 OPENETH_INT_SOURCE_RXB | OPENETH_INT_SOURCE_TXB);
    g_assert_false(qtest_get_irq(qts, ESP32S3_EMAC_SOURCE));

    qtest_quit(qts);
}

static void test_emac_not_instantiated_without_nic(void)
{
    QTestState *qts = qts_start_without_openeth();

    assert_openeth_instantiated(qts, false);

    qtest_quit(qts);
}

static void test_emac_instantiated_with_openeth_nic(void)
{
    QTestState *qts = qts_start_with_openeth();

    assert_openeth_instantiated(qts, true);

    qtest_quit(qts);
}

int main(int argc, char **argv)
{
    g_test_init(&argc, &argv, NULL);

    qtest_add_func("/esp32s3/ana/pll-done", test_ana_pll_done);
    qtest_add_func("/esp32s3/machine/single-cpu-boot", test_single_cpu_boot);
    qtest_add_func("/esp32s3/generic-mmio/compatibility-storage",
                   test_generic_mmio_compatibility_storage);
    qtest_add_func("/esp32s3/spi0/mem-register-surface",
                   test_spi0_mem_register_surface);
    qtest_add_func("/esp32s3/assist-debug/register-surface",
                   test_assist_debug_register_surface);
    qtest_add_func("/esp32s3/apb-ctrl/register-surface",
                   test_apb_ctrl_register_surface);
#ifndef _WIN32
    qtest_add_func("/esp32s3/cache/flash-mmu-mapping-ctrl1",
                   test_cache_flash_mmu_mapping_and_ctrl1_state);
    qtest_add_func("/esp32s3/cache/psram-mmu-mapping",
                   test_cache_psram_mmu_mapping);
    qtest_add_func("/esp32s3/cache/deferred-completion",
                   test_cache_deferred_completion_semantics);
    qtest_add_func("/esp32s3/cache/deferred-ordering-clear",
                   test_cache_deferred_ordering_and_clear);
    qtest_add_func("/esp32s3/cache/fault-preserved-deferred",
                   test_cache_fault_preserved_across_deferred_ops);
    qtest_add_func("/esp32s3/cache/invalid-mmu-fault-irq",
                   test_cache_invalid_mmu_fault_irq);
    qtest_add_func("/esp32s3/cache/core0-dbus-reject-irq",
                   test_cache_core0_dbus_reject_irq);
    qtest_add_func("/esp32s3/cache/core0-ibus-reject-irq",
                   test_cache_core0_ibus_reject_irq);
#endif
    qtest_add_func("/esp32s3/gpio/iomux", test_gpio_and_iomux_state);
    qtest_add_func("/esp32s3/gpspi/completion-irq", test_gpspi_completion_irq);
    qtest_add_func("/esp32s3/gpio/remap-state", test_gpio_signal_remap_state);
    qtest_add_func("/esp32s3/gpio/remap-non-default", test_gpio_signal_non_default_routing);
    qtest_add_func("/esp32s3/spi1/usr-rx-overwrite", test_spi1_usr_rx_overwrites_all_bytes);
    qtest_add_func("/esp32s3/spi1/usr-length-matrix", test_spi1_usr_length_matrix);
    qtest_add_func("/esp32s3/spi1/cmd-length-edges", test_spi1_cmd_length_edges);
#ifndef _WIN32
    qtest_add_func("/esp32s3/jtag/rx-tx", test_usb_serial_jtag_rx_tx);
#endif
    qtest_add_func("/esp32s3/i2c/done-ack", test_i2c_done_and_ack_semantics);
    qtest_add_func("/esp32s3/i2c/read-path-deferred", test_i2c_read_path_and_deferred_complete);
    qtest_add_func("/esp32s3/i2c/unsupported-modes", test_i2c_unsupported_modes);
    qtest_add_func("/esp32s3/rtc/clk-update", test_rtc_clk_update_propagates_to_system_and_uart);
    qtest_add_func("/esp32s3/system/clock-register-contract",
                   test_system_clock_register_contract);
    qtest_add_func("/esp32s3/system/core1-runstall",
                   test_system_core1_runstall_transition);
    qtest_add_func("/esp32s3/intmatrix/mapping-status-reserved",
                   test_intmatrix_mapping_status_reserved);
    qtest_add_func("/esp32s3/rtc/explicit-register-surface",
                   test_rtc_explicit_register_surface);
    qtest_add_func("/esp32s3/rtc/timer-wakeup", test_rtc_timer_wakeup_transition);
    qtest_add_func("/esp32s3/rtc/gpio-wakeup", test_rtc_gpio_low_wakeup_transition);
    qtest_add_func("/esp32s3/rtc/gpio-reject", test_rtc_gpio_low_reject_transition);
    qtest_add_func("/esp32s3/rtc/ext1-wakeup", test_rtc_ext1_low_wakeup_transition);
    qtest_add_func("/esp32s3/rtc/ext1-high-wakeup", test_rtc_ext1_high_wakeup_transition);
    qtest_add_func("/esp32s3/rtc/ext1-immediate-wakeup",
                   test_rtc_ext1_immediate_wakeup_transition);
    qtest_add_func("/esp32s3/rtc/state0-hardware-bits", test_rtc_state0_requires_hardware_sleep_bits);
    qtest_add_func("/esp32s3/rtc/reset-transitions", test_rtc_reset_transitions);
    qtest_add_func("/esp32s3/rtc/cpu-stall", test_rtc_cpu_stall_transition);
    qtest_add_func("/esp32s3/uart/clock-timing", test_uart_clock_dependent_timing);
    qtest_add_func("/esp32s3/uart/rx-timeout-multi-config", test_uart_rx_timeout_multi_config);
    qtest_add_func("/esp32s3/sha/irq", test_sha_irq);
    qtest_add_func("/esp32s3/sha/dma-start-continue", test_sha_dma_start_and_continue_irq_paths);
    qtest_add_func("/esp32s3/gpspi/dma-tx-rx-handoff", test_gpspi_dma_txrx_handoff);
    qtest_add_func("/esp32s3/emac/not-instantiated-without-nic",
                   test_emac_not_instantiated_without_nic);
    qtest_add_func("/esp32s3/emac/instantiated-with-openeth-nic",
                   test_emac_instantiated_with_openeth_nic);
    qtest_add_func("/esp32s3/emac/link-loopback", test_emac_link_and_loopback_surface);
    qtest_add_func("/esp32s3/pms/modeled-surface", test_pms_modeled_surface);
    qtest_add_func("/esp32s3/rng/modeled-surface", test_rng_modeled_surface);
    qtest_add_func("/esp32s3/efuse/explicit-contract",
                   test_efuse_explicit_contract);

    return g_test_run();
}
